[
    {
    "id": "80",
    "title": "DRDO Holds Back-to-Back Pralay Missile Test Flights",
    "date": "2025-07-30",
    "subject": "DRDO, Pralay Missile, Missile Technology, Defence, National Security, Make in India, Atmanirbhar Bharat, UPSC Relevance",
    "source": "UPSC CSE Notes",
    "summary": "The DRDO successfully conducted back-to-back test flights of the indigenously developed Pralay quasi-ballistic surface-to-surface missile from Dr. A.P.J. Abdul Kalam Island, off the Odisha coast. These tests validated the missile's maximum and minimum range capabilities with pinpoint accuracy, enhancing India’s tactical strike capability and deterrence posture. The Pralay missile, with a range of 150-500 km, is capable of carrying multiple warheads and features advanced navigation and guidance systems. Defence Minister Rajnath Singh hailed the tests as a significant milestone for India's indigenous defence capability, reinforcing the 'Make in India' and 'Atmanirbhar Bharat' initiatives.",
    "link": "post-80.html",
    "resource_link": "63.png"
},
    {
    "id": "79",
    "title": "No Decision Taken to Update National Population Register (NPR): Centre",
    "date": "2025-07-30",
    "subject": "NPR, Census, NRC, Citizenship, Government Policy, UPSC Relevance",
    "source": "UPSC CSE Notes",
    "summary": "The Union Government has informed the Lok Sabha that no decision has been taken to update the National Population Register (NPR), a clarification that may reduce public apprehension given its link to the NRC. The NPR was last updated in 2015-16, holding data of 119 crore residents. Separately, the Census 2027 is planned in two phases, including houselisting and population enumeration, with caste enumeration also to be included. Both NPR and NRC remain politically sensitive, and the inclusion of caste data in the census could significantly influence future policy-making and social justice agendas.",
    "link": "post-79.html",
    "resource_link": "62.png"
},
    {
    "id": "78",
    "title": "Manipur Preparing for Special Intensive Revision (SIR)",
    "date": "2025-07-30",
    "subject": "Elections, Governance, Ethnic Conflict, Manipur, Electoral Roll, NRC, EC",
    "source": "The Hindu",
    "summary": "The Election Commission's Special Intensive Revision (SIR) of electoral rolls in Manipur has raised concerns amidst ongoing ethnic tensions and demands for an NRC. Political parties, particularly the MPCC, oppose changing voting addresses of IDPs to relief camps, fearing disruption of peace and legitimization of displacement. The move comes as the conflict between Meitei and Kuki-Zo communities persists, with 'illegal immigration' being a core concern. While EC emphasizes accuracy, the exercise is politically sensitive, highlighting the need for transparency and fairness to maintain public trust in the democratic process.",
    "link": "post-78.html",
    "resource_link": "61.png"
},
    {
    "id": "77",
    "title": "ICJ Advisory Opinion on Climate Obligations",
    "date": "2025-07-30",
    "subject": "Environment, International Law, Climate Justice, ICJ, UNFCCC, Paris Agreement",
    "source": "The Hindu",
    "summary": "The ICJ's recent advisory opinion on climate obligations offers both positive takeaways and significant shortcomings. It reaffirmed the full climate regime and CBDR-RC principle, acknowledging dynamic development status. However, its reinterpretation of the 1.5°C target lacks legal soundness, and it fails to break new ground on enforcement. Critically, it neglects developmental imperatives of the Global South and treats equity merely as a guiding principle rather than a source of new obligations, potentially limiting its impact on global climate negotiations.",
    "link": "post-77.html",
    "resource_link": "60.png"
},
    {
    "id": "76",
    "title": "From Glory to Decline",
    "date": "2025-07-30",
    "subject": "Cultural Heritage, Governance, Regional Development, Chola Dynasty",
    "source": "The Hindu",
    "summary": "The Aadi Thiruvathirai Festival at Gangaikonda Cholapuram, attended by PM Modi, highlighted the historical significance of Rajendra Chola I and the UNESCO Great Living Chola Temples. Despite this rich heritage, Ariyalur district remains backward, suffering from a lack of promised rail connectivity, underdeveloped industrial estates, and neglected scientific tourism sites. While the state government has announced initiatives, locals express discontent, demanding sustained policy focus on infrastructure, tourism, and industrial development to truly rejuvenate the region.",
    "link": "post-76.html",
    "resource_link": "59.png"
},
    {
    "id": "75",
    "title": "Why the Gini Index is wrong about India",
    "date": "2025-07-30",
    "subject": "Economy, Inequality, Gini Index, Social Issues, India",
    "source": "Provided Text",
    "summary": "The Gini Index ranks India as a \"moderately low\" inequality society (25.5), yet on-ground realities contradict this. The index underestimates inequality due to large informal employment, low-income thresholds, and non-reporting of taxable income. India faces significant wealth, gender, digital, and educational disparities, with intersectional issues exacerbating these challenges. The provided Gini Index score fails to reflect the true multi-dimensional nature of inequality in India.",
    "link": "post-75.html",
    "resource_link": "58.png"
},
    {
    "id": "74",
    "title": "Adopt Formalisation to Power Productivity Growth",
    "date": "2025-07-30",
    "subject": "Economy, Labour, Manufacturing, Formalisation, Productivity, Employment",
    "source": "The Hindu",
    "summary": "India's manufacturing sector is increasingly relying on contract labour, moving towards informalisation. This trend, despite comprehensive labour laws, leads to worker exploitation, wage disparities, and negatively impacts labour productivity due to high turnover and low skill investment. While some high-skill and capital-intensive segments show exceptions, the overall picture is concerning for India's ambition to become a global manufacturing hub. Policy suggestions include incentivizing longer fixed-term contracts and reviving schemes like PMRPY to promote stable, skill-rich employment and ensure data-driven policy monitoring.",
    "link": "post-74.html",
    "resource_link": "57.png"
},
    {
    "id": "73",
    "title": "Bihar's Dark Side: Girl Child Trafficking",
    "date": "2025-07-30",
    "subject": "Girl Child Trafficking, Human Trafficking, Child Exploitation, Social Issues, Bihar, UPSC CSE",
    "source": "UPSC CSE Notes",
    "summary": "Bihar has emerged as a major hub for girl child trafficking in India, fueled by poverty, lack of regulatory oversight, and societal acceptance. Trafficked girls are forced into orchestras, dance troupes, and the flesh trade, enduring severe abuse. This report highlights key statistics, conditions of trafficked girls, contributing factors to Bihar's vulnerability, and failures in the system. It also outlines the legal framework and proposes a multi-pronged PICKET strategy for prevention, prosecution, rehabilitation, and systemic change.",
    "link": "post-73.html",
    "resource_link": "56.png"
},
    {
    "id": "72",
    "title": "Interrupted Growth: Industrial Output Faces Climate Headwinds",
    "date": "2025-07-30",
    "subject": "Industrial Output, Climate Disruptions, Economic Reporting",
    "source": "The Hindu",
    "summary": "India's industrial output growth hit a 10-month low in June 2025, primarily due to significant contractions in mining and electricity output caused by erratic monsoon patterns and related disruptions. While official economic data often overlooks climate-related impacts, this editorial from The Hindu highlights the urgent need for India to integrate climate attribution into its economic reporting, citing global best practices and the increasing frequency of extreme weather events. Despite the overall slowdown, sectors like capital goods, intermediate goods, and infrastructure goods showed resilience, indicating the positive impact of government spending. The article emphasizes the importance of data transparency and institutional accountability to build resilient economic systems.",
    "link": "post-72.html",
    "resource_link": "55.png"
},
    {
    "id": "71",
    "title": "Assam govt. launches eviction drive to clear encroached forest land on Nagaland boundary",
    "date": "2025-07-30",
    "subject": "Environment, Inter-State Relations, Governance",
    "source": "The Hindu",
    "summary": "The Assam government initiated an eviction drive in Rengma Reserve Forest, Golaghat district, targeting 11,000 bighas (~3,600 acres) of encroached forest land along the Assam-Nagaland border. The drive, launched after CM Himanta Biswa Sarma's visit, involved heavy machinery and personnel to demolish structures, with over 20% of the land cleared in Phase I. Most encroachers, primarily migrant Muslims, had already vacated after notices. While CM Sarma emphasized the need to curb encroachment and demographic alteration, the NSCN (Niki Sumi faction) condemned it as a 'land grab' targeting Naga territories. The action highlights issues of forest conservation, inter-state boundary disputes, and the balance between environmental protection and human settlement.",
    "link": "post-71.html",
    "resource_link": "54.png"
},
    {
    "id": "70",
    "title": "Will step in if 'mass exclusion' found in draft voter rolls: SC",
    "date": "2025-07-30",
    "subject": "Polity & Governance, Electoral Reforms, Judicial Review",
    "source": "The Hindu",
    "summary": "The Supreme Court assured intervention if mass exclusions (allegedly 65 lakh) from Bihar's draft electoral rolls are found to be wrongful. Justices Surya Kant and Joymalya Bagchi stated they would act immediately if individuals marked as dead or shifted are found alive. Petitioners, Kapil Sibal and Prashant Bhushan, raised concerns over lack of transparency and likened the EC's actions to 'citizenship screening.' The Election Commission clarified that the draft roll is based on a summary revision and citizens have until September 1 to file claims before the final list is published on September 30. This case highlights the role of the Election Commission, the importance of free and fair elections, the right to vote, and the Supreme Court's power of judicial review.",
    "link": "post-70.html",
    "resource_link": "53.png"
},
    {
    "id": "69",
    "title": "SC to begin hearing on Presidential Reference with States' arguments",
    "date": "2025-07-30",
    "subject": "Polity & Governance, Constitutional Law, Centre-State Relations",
    "source": "The Hindu",
    "summary": "The Supreme Court began hearings on a Presidential Reference seeking clarity on the timeline for President and Governors in assenting to State Bills. Tamil Nadu and Kerala challenged its maintainability, arguing it addresses already adjudicated issues, citing the Tamil Nadu Governor Case and Cauvery Water Disputes Tribunal Reference as precedents. Kerala's counsel stated it was an 'appeal in disguise' as settled matters are binding. The Constitution Bench, headed by CJI B.R. Gavai, set deadlines for written submissions and oral arguments from the Union Government and States. The case is relevant for understanding separation of powers, Centre-State relations, and the role of Article 143.",
    "link": "post-69.html",
    "resource_link": "52.png"
},
    {
    "id": "68",
    "title": "No one asked India to stop Operation Sindoor: Modi",
    "date": "2025-07-30",
    "subject": "International Relations, Internal Security, Indian Polity",
    "source": "The Hindu",
    "summary": "Prime Minister Modi addressed the Lok Sabha on July 30, 2025, regarding Operation Sindoor, India's military response to the Pahalgam terror attack. He vehemently denied claims of international pressure leading to a ceasefire with Pakistan, asserting that India's overwhelming military response, not mediation, was responsible. Modi highlighted Operation Sindoor's success in crippling Pakistani air defenses and stated the operation is 'halted, not ended,' serving as a warning to Pakistan for any future terror attacks. He also criticized the Congress party for questioning India's actions and historic policies, including the Indus Waters Treaty. The statement reinforces India's image as self-reliant in defense and challenges narratives of foreign influence on its military decisions.",
    "link": "post-68.html",
    "resource_link": "51.png"
},
    {
    "id": "67",
    "title": "A Just Equilibrium - Judicial Review of Executive Discretion",
    "date": "2025-07-29",
    "subject": "Governance, Indian Polity, Constitutional Law",
    "source": "Indian Express",
    "summary": "The Supreme Court's decision in 'The State of Tamil Nadu vs The Governor of Tamil Nadu (2025)' has brought to the forefront critical issues concerning the limits of gubernatorial discretion and the judicial review of sovereign functions, impacting the separation of powers and constitutional equilibrium. The Court held that withholding assent by the Governor for an unreasonable period is unconstitutional, mandating decisions within three months. This has led to a presidential reference seeking an advisory opinion from the Supreme Court, raising questions about judicial intervention in executive discretion and the interplay between Articles 200, 201, 142, and 143. The ongoing debate emphasizes the need for judicial self-restraint to avoid politicization of the judiciary and juridification of politics, ensuring the preservation of institutional boundaries and the principle of checks and balances.",
    "link": "post-67.html",
    "resource_link": "50.png"
},
    {
    "id": "66",
    "title": "ICJ's Advisory Opinion on Climate Change - A Compass for Global and Indian Climate Action",
    "date": "2025-07-29",
    "subject": "International Relations, Environment & Ecology, Governance, Climate Justice",
    "source": "Indian Express",
    "summary": "On July 23, 2025, the International Court of Justice (ICJ) issued a landmark advisory opinion on states' legal obligations regarding climate change, initiated by Vanuatu. Though not legally binding, this ruling has significant implications, reinforcing the principle of Common but Differentiated Responsibilities (CBDR) and highlighting the need for science-based action. For India, it strengthens its stance on climate equity while also prompting a review of fossil fuel subsidies and regulatory enforcement to balance development with climate responsibilities.",
    "link": "post-66.html",
    "resource_link": "49.png"
},
    {
    "id": "65",
    "title": "PM Modi's Visit to Maldives - A Diplomatic Reset",
    "date": "2025-07-29",
    "subject": "International Relations, Diplomacy, India's Neighbourhood",
    "source": "Indian Express",
    "summary": "Prime Minister Narendra Modi's visit to the Maldives during its Independence Day celebrations in July 2025 signals a diplomatic reset in Indo-Maldivian ties. After a period of friction caused by the 'India Out' campaign and pro-China policies of Maldivian President Mohamed Muizzu, this visit marked the return to constructive engagement. Strategic interests including maritime security, geostrategic influence, and regional diplomacy are central to India's renewed focus on Maldives.",
    "link": "post-65.html",
    "resource_link": "48.png"
},

    {
  "id": "64",
  "title": "China's Medog Hydropower Project on Yarlung Tsangpo - Strategic, Ecological & Diplomatic Concerns for India",
  "date": "2025-07-29",
  "subject": "International Relations, Ecology, Internal Security, Water Diplomacy",
  "source": "Indian Express",
  "summary": "China has begun constructing a massive ¥1.2 trillion hydropower project on the Yarlung Tsangpo River in Medog County, Tibet—just 30 km from the Indian border. The project raises major strategic, environmental, and legal concerns for India as the river flows into Arunachal Pradesh as the Siang and becomes the Brahmaputra. India fears downstream ecological damage, water flow disruption, and seismic risks, especially given China's unilateral approach and lack of transparency. India must respond diplomatically and strengthen its domestic water security mechanisms.",
  "link": "post-64.html",
  "resource_link": "47.png"
},

    {
  "id": "63",
  "title": "India's 1st Private Heavy Water Upgrade Test Facility",
  "date": "2025-07-29",
  "subject": "Science & Technology, Nuclear Energy, Infrastructure Development",
  "source": "Government of India",
  "summary": "India has launched its first private heavy water upgrade testing facility in Palghar, Maharashtra, in collaboration with TEMA India and BARC. This public-private milestone enhances nuclear energy infrastructure, reduces reactor commissioning time, and promotes indigenisation of critical technology. The first batch of equipment has been dispatched to RAPP-8, with future projects planned in Gorakhpur and Kaiga.",
  "link": "post-63.html",
  "resource_link": "46.png"
},

    {
    "id": "62",
    "title": "National Education Policy (NEP) - Five Years of Transformative Change",
    "date": "2025-07-29",
    "subject": "Education Policy, Governance, Social Justice, Human Capital, Technology",
    "source": "Indian Express",
    "summary": "This document summarizes PM Modi's address on the 5th anniversary of NEP, highlighting its role in holistic development, promotion of research, and its focus on a student-centric approach. It emphasizes education as a tool for self-reliance and national strength, integrating Indian culture with modern technology and global standards. The notes also detail NEP's relevance for UPSC CSE across GS Papers II, III, IV, Essay, and Interviews, and suggest further research areas.",
    "link": "post-62.html",
    "resource_link": "45.png"
},
    {
    "id": "61",
    "title": "Gavri of the Mewar Bhils - A Ritual of Resistance and Renewal",
    "date": "2025-07-29",
    "subject": "Indian Culture, Social Justice, Tribal Studies, Ethics",
    "source": "Indian Express",
    "summary": "Gavri is a 40-day folk ritual celebrated annually by the Bhil community in the Mewar region of Rajasthan. It involves dance-dramas, songs, and ceremonial performances to honor Gorkhiya Mata (Parvati). Performed by male-only troupes, it subverts caste and class hierarchies, asserts Bhil identity, promotes gender fluidity, and reaffirms tribal ecological ethics. Documented by IAS officer Aditi Mehta and photographed by Padma Shri Sudharak Olwe, Gavri is a significant example of India's tribal pluralism and indigenous resistance, offering a counter-narrative to mainstream social structures.",
    "link": "post-61.html",
    "resource_link": "44.png"
},
    {
    "id": "60",
    "title": "Stray Dog Menace & Supreme Court Suo Motu Action (July 2025)",
    "date": "2025-07-29",
    "subject": "Social Issues, Governance, Ethics, Law, Animal Welfare",
    "source": "Indian Express",
    "summary": "The Supreme Court of India has taken suo motu cognizance of the escalating stray dog menace, particularly in Delhi and surrounding regions, due to alarming reports of attacks on infants and the elderly and the associated rabies risk. This action highlights the critical balance between public safety and animal rights. The MCD has formed a panel to establish shelter homes, while legal and ethical dilemmas surrounding feeding practices, urban governance, and health infrastructure are being debated. The issue involves Constitutional provisions (Article 21), animal welfare laws (Prevention of Cruelty to Animals Act, 1960), and calls for a multi-pronged strategy encompassing sterilization, vaccination, awareness, and better administrative measures.",
    "link": "post-60.html",
    "resource_link": "43.png"
},
    {
    "id": "59",
    "title": "Divya Deshmukh - A New Era in Indian Women's Chess",
    "date": "2025-07-29",
    "subject": "Sports, Women Empowerment, Youth, Social Issues",
    "source": "Indian Express",
    "summary": "Divya Deshmukh, 19, became India's 4th Woman Grandmaster (GM) and 88th overall GM by winning the FIDE Women's World Cup in Georgia (2025), defeating Koneru Humpy in the final. This achievement is significant as she bypassed the usual GM norm requirements due to FIDE regulations for World Cup winners, marking a generational shift and highlighting India's growing dominance in women's chess. It boosts women's sports and signifies the depth of Indian chess talent.",
    "link": "post-59.html",
    "resource_link": "42.png"
},
    {
    "id": "58",
    "title": "Supreme Court & Judicial Accountability - Cash Row Case",
    "date": "2025-07-29",
    "subject": "Indian Polity, Judiciary, Constitutional Law, Ethics",
    "source": "Indian Express",
    "summary": "Justice Yashwant Varma of the Allahabad High Court challenged an in-house inquiry by the SC into allegations of burnt currency found at his residence. The case raises critical questions about the legality of the in-house procedure versus the constitutional parliamentary removal process for judges (Articles 124 & 218, Judges (Inquiry) Act, 1968). The SC heard arguments on the extra-constitutional nature of the inquiry and concerns over media leaks, emphasizing the proper channel for judicial removal and the timing of the challenge.",
    "link": "post-58.html",
    "resource_link": "41.png"
},
    {
    "id": "57",
    "title": "Supreme Court on Electoral Roll Revision - July 2025",
    "date": "2025-07-29",
    "subject": "Indian Polity, Electoral Reforms, Judiciary, Governance",
    "source": "Indian Express",
    "summary": "The Supreme Court declined to stay the publication of the draft electoral roll in Bihar, reiterating its earlier directive for the Election Commission to consider Aadhaar, EPIC, and Ration Cards for inclusion. The court emphasized the prima facie credibility of Aadhaar and EPIC, warning against en masse exclusion while allowing for case-by-case tackling of forgery. It clarified that the draft roll allows for public objections and reserved its power to intervene if unconstitutionality is proven, highlighting its role in safeguarding democratic processes.",
    "link": "post-57.html",
    "resource_link": "40.png"
},
    {
    "id": "56",
    "title": "Glacial Lake Outburst Floods (GLOFs): India's Preparedness and Challenges",
    "date": "2025-07-28",
    "subject": "Disaster Management, Climate Change, Environment, International Relations",
    "source": "The Hindu",
    "summary": "India faces increasing GLOF risks in the Himalayas due to climate change, with recent events like the Sikkim GLOF highlighting vulnerabilities. The nation is implementing a five-pronged strategy involving hazard assessment, EWS, and community engagement. However, challenges include accessibility, sparse monitoring, and trans-boundary data-sharing issues, necessitating greater regional cooperation and technological advancements.",
    "link": "post-56.html",
    "resource_link": "39.png"
},
    {
    "id": "55",
    "title": "Understanding Russia's Taliban Gauntlet",
    "date": "2025-07-28",
    "subject": "International Relations, Security, Geopolitics, Ethics",
    "source": "The Hindu",
    "summary": "Russia officially recognized the Islamic Emirate of Afghanistan on July 3, 2025, marking a significant policy shift after two decades of antagonism. This pragmatic move is driven by counterterrorism efforts against IS-K and hopes for regional trade, despite ongoing security concerns and a questionable Taliban anti-IS-K record. It sets a precedent for China and Central Asian states, while India maintains engagement without formal recognition.",
    "link": "post-55.html",
    "resource_link": "38.png"
},
    {
  "id": "54",
  "title": "Clearing the Air on 'Citizenship' in Bihar Poll Roll Revision",
  "date": "2025-07-28",
  "subject": "Citizenship, Electoral Reforms, Election Commission, Constitutional Law, Governance",
  "source": "The Hindu",
  "summary": "This article clarifies that only Indian citizens can vote or be elected, as per constitutional and statutory law. It emphasizes the ECI's duty to verify citizenship for electoral rolls, dismissing Aadhaar as proof of citizenship.",
  "link": "post-54.html",
  "resource_link": "37.png"
},
    {
  "id": "53",
  "title": "Criminalising Adolescent Sex & POCSO Act Reforms",
  "date": "2025-07-28",
  "subject": "Law, Governance, Social Justice, Child Rights, Judicial Reforms",
  "source": "The Hindu",
  "summary": "This note discusses the criminalization of consensual adolescent sex under POCSO, judicial interventions, and Law Commission recommendations. It highlights concerns with the current law and suggests reforms for child protection.",
  "link": "post-53.html",
  "resource_link": "36.png"
},
      {
    "id": "52",
    "title": "Activists demand Devadasi survey in Karnataka without condition of age limit",
    "date": "2025-07-28",
    "subject": "Social Justice, Governance, Women's Empowerment, Human Rights",
    "source": "The Hindu",
    "summary": "Activists and NLSIU are urging the Karnataka government to conduct the third Devadasi survey without an age limit to ensure comprehensive identification, as previous surveys excluded many women and missed a significant population, despite the practice being banned since 1982.",
    "link": "post-52.html",
    "resource_link": "35.png"
  },
    {
    "id": "51",
    "title": "Rajasthan govt. to demolish unsafe school buildings",
    "date": "2025-07-28",
    "subject": "Governance, Disaster Management, Infrastructure Development, Public Administration, Education",
    "source": "The Hindu",
    "summary": "Following a school collapse, the Rajasthan government will demolish unsafe school buildings, use container classrooms, and launch a statewide survey. A ₹150 crore fund, AI-GIS integration for monitoring, and strict quality control, including private schools and MP/MLA contributions, aim to ensure structural safety and accountability.",
    "link": "post-51.html",
    "resource_link": "34.png"
},
    {
    "id": "50",
    "title": "Notes for UPSC CSE Aspirant: Delhi Govt.'s Move to Amend Labour Laws",
    "date": "2025-07-28",
    "subject": "Governance, Social Justice, Economy, Industrial Policy, Polity",
    "source": "The Hindu",
    "summary": "Delhi government's proposed labour law amendments (e.g., raising applicability thresholds) prioritize 'Ease of Doing Business' but critics argue they strip millions of workers of rights. This highlights a critical policy conflict, impacting informal sector workers and raising questions about social protection versus economic flexibility.",
    "link": "post-50.html",
    "resource_link": "33.png"
},
    {
    "id": "49",
    "title": "The Return of the Native",
    "date": "2025-07-28",
    "subject": "Sociology, Ethics, Governance, Social Justice, Tribal Issues",
    "source": "The Hindu",
    "summary": "This article highlights the conflict between traditional tribal justice (Chadotaru) and formal law in Gujarat and Rajasthan, detailing the forced exile and hardship faced by the Kodarvi tribe. It underscores the vital role of state and community collaboration in resolving social exclusion.",
    "link": "post-49.html",
    "resource_link": "32.png"
},
    {
    "id": "48",
    "title": "'Logistics and Warehousing Policy to be launched soon'",
    "date": "2025-07-28",
    "subject": "Urban Governance, Infrastructure, Sustainable Development, Economy, Technology",
    "source": "The Hindu",
    "summary": "Delhi's upcoming Logistics and Warehousing Policy 2025 aims to ease traffic, curb pollution through green corridors, and boost ease of doing business via dedicated hubs and technology, positioning Delhi as a leader in sustainable urban freight management.",
    "link": "post-48.html",
    "resource_link": "31.png"
},
    {
    "id": "47",
    "title": "Maharashtra halts Ladki Bahin aid for 26.34 lakh beneficiaries",
    "date": "2025-07-28",
    "subject": "Governance, Social Justice, Women Empowerment, Electoral Politics, Public Administration",
    "source": "The Hindu",
    "summary": "Maharashtra suspended Ladki Bahin scheme payments for 26.34 lakh beneficiaries pending verification to curb fraudulent claims. While 2.25 crore continue, this highlights the need for transparent governance, robust fraud detection in welfare schemes, and the intersection of politics with social welfare.",
    "link": "post-47.html",
    "resource_link": "30.png"
},
    {
    "id": "46",
    "title": "Chola dynasty's legacy provides road map for modern India: PM",
    "date": "2025-07-28",
    "subject": "History, Governance, National Security, International Relations",
    "source": "The Hindu",
    "summary": "PM Modi highlighted the Chola dynasty's military, administrative, and economic brilliance as a roadmap for modern India's development, emphasizing naval strength, local governance, and safeguarding core values, while commemorating Chola rulers' contributions to national pride and security.",
    "link": "post-46.html",
    "resource_link": "29.png"
},
    {
    "id": "45",
    "title": "Eight killed in stampede at temple in Haridwar",
    "date": "2025-07-28",
    "subject": "Disaster Management, Governance, Social Issues",
    "source": "The Hindu",
    "summary": "Eight pilgrims died and 30 injured in a stampede at Mansa Devi temple, Haridwar, triggered by a false rumor of an electric line snap. The incident exposed critical gaps in crowd control and emergency planning at religious sites, highlighting the need for improved disaster preparedness and regulatory frameworks to ensure public safety in high-traffic religious destinations.",
    "link": "post-45.html",
    "resource_link": "28.png"
},
    {
    "id": "44",
    "title": "Ocean Heatwaves Reach Extreme Levels, Indicate Tipping Point",
    "date": "2025-07-27",
    "subject": "Environment & Ecology, Economy, Disaster Management, Geography, International Relations",
    "source": "The Economic Times",
    "summary": "China's ambitious dam construction on the upper reaches of the Brahmaputra (Yarlung Tsangpo in Tibet) and its implications for downstream riparian countries, particularly India and Bangladesh.",
    "link": "post-44.html",
    "resource_link": "27.png"
},
    {
    "id": "43",
    "title": "Ocean Heatwaves Reach Extreme Levels, Indicate Tipping Point",
    "date": "2025-07-27",
    "subject": "Environment, Climate Change",
    "source": "The Hindu",
    "summary": "2023 saw extreme marine heatwaves across 96% of oceans, with 53.6 billion degrees C-days thermal stress, suggesting Earth's tipping point.",
    "link": "post-43.html",
    "resource_link": "26.png"
},
    {
    "id": "42",
    "title": "Android Phones Provide Early Earthquake Warnings Globally",
    "date": "2025-07-27",
    "subject": "Science & Technology, Disaster Management",
    "source": "The Hindu",
    "summary": "Android phones use accelerometers for earthquake alerts in 98 countries, detecting P-waves before destructive S-waves, significantly improving disaster preparedness globally.",
    "link": "post-42.html",
    "resource_link": "25.png"
},
    {
    "id": "41",
    "title": "Altermagnet's charge carriers change in different directions",
    "date": "2025-07-27",
    "subject": "Science & Technology",
    "source": "The Hindu",
    "summary": "Indian researchers discovered chromium-antimony (CrSb) as the first altermagnet with direction-dependent charge carriers (electrons/holes), promising for spintronics and electronics.",
    "link": "post-41.html",
    "resource_link": "24.png"
},
    {
    "id": "40",
    "title": "U.K.-India FTA May Favor Patent Owners, Affecting Drug Access",
    "date": "2025-07-27",
    "subject": "Economy, Health, International Relations",
    "source": "The Hindu",
    "summary": "UK-India FTA patent clauses may favor owners, impacting affordable medicine access; concerns over evergreening, transparency, despite export benefits.",
    "link": "post-40.html",
    "resource_link": "23.png"
},
    {
    "id": "39",
    "title": "Two half-dose combination of drugs right for BP control in Indians: study",
    "date": "2025-07-27",
    "subject": "Health, Science & Technology",
    "source": "The Hindu",
    "summary": "Indian study in Nature Medicine finds dual hypertension drug combos effective, safe; recommends half-doses, avoiding polypharmacy for better compliance.",
    "link": "post-39.html",
    "resource_link": "22.png"
},
    {
    "id": "38",
    "title": "India's Advisory on Border Clashes in Cambodia - Key Points for UPSC CSE",
    "date": "2025-07-27",
    "subject": "International Relations, Geopolitics",
    "source": "The Hindu",
    "summary": "India advises citizens to avoid Cambodia-Thailand border clashes (32 casualties), emphasizing geopolitical, humanitarian, and diplomatic implications for UPSC CSE.",
    "link": "post-38.html",
    "resource_link": "21.png"
},
    {
    "id": "37",
    "title": "Ashok Gajapathi Raju Sworn In as Goa Governor",
    "date": "2025-07-27",
    "subject": "Polity & Governance",
    "source": "The Hindu",
    "summary": "Former Union Minister Ashok Gajapathi Raju sworn in as Goa's 22nd Governor, replacing P.S. Sreedharan Pillai.",
    "link": "post-37.html",
    "resource_link": "20.png"
},
    {
    "id": "36",
    "title": "Amit Shah: India's Rising Stature Brings Security Challenges",
    "date": "2025-07-27",
    "subject": "National Security, Governance",
    "source": "The Hindu",
    "summary": "Amit Shah warns rising India faces dynamic security challenges; calls for coordinated Central-State action, focus on narcotics, LWE.",
    "link": "post-36.html",
    "resource_link": "19.png"
},
    {
    "id": "35",
    "title": "Operation Sindoor: India's Decisive Message to Pakistan",
    "date": "2025-07-27",
    "subject": "National Security, Defence",
    "source": "The Hindu",
    "summary": "Army Chief states 'Operation Sindoor' was decisive response to Pakistan, eliminating 9 terrorists with zero collateral damage, reinforcing India's sovereignty.",
    "link": "post-35.html",
    "resource_link": "18.png"
},
    {
    "id": "34",
    "title": "Cast-off capital",
    "date": "2025-07-27",
    "subject": "Environment, Economy",
    "source": "The Hindu",
    "summary": "Asia's largest textile recycling hub, Panipat, faces severe water and air pollution from illegal bleaching units, impacting health and environment, prompting NGT action.",
    "link": "post-34.html",
    "resource_link": "17.png"
},
    {
    "id": "33",
    "title": "Modi: Central Projects Drive 'Viksit Tamil Nadu'",
    "date": "2025-07-27",
    "subject": "Economy, Governance, Infrastructure",
    "source": "The Hindu",
    "summary": "PM Modi states over ₹3 lakh crore central projects in Tamil Nadu aim for 'Viksit Tamil Nadu', boosting infrastructure, trade, and employment.",
    "link": "post-33.html",
    "resource_link": "15.png"
},
    {
    "id": "32",
    "title": "Modi, Muizzu Reset India-Maldives Ties",
    "date": "2025-07-27",
    "subject": "International Relations",
    "source": "The Hindu",
    "summary": "PM Modi's Maldives visit signals major bilateral ties reset, overcoming past strains with focus on deepening cooperation and shared interests.",
    "link": "post-32.html",
    "resource_link": "14.png"
},
    {
    "id": "31",
    "title": "Bengal Governor Returns Aparajita Bill Over Centre's Objections",
    "date": "2025-07-26",
    "subject": "Polity & Governance",
    "source": "Indian Express",
    "summary": "Bengal Governor returned Aparajita Bill to state, citing Centre's objections to proposed BNS changes on rape penalties for being disproportionate and harsh.",
    "link": "post-31.html",
    "resource_link": "https://indianexpress.com/article/cities/kolkata/bengal-centre-raises-concern-over-death-penalty-clause-in-aparajita-bill-governor-sends-it-back-to-state-govt-10150139/"
},
    {
    "id": "30",
    "title": "WHO's 'Global Specs 2030' for Affordable Eyecare",
    "date": "2025-07-26",
    "subject": "Health & Social Issues",
    "source": "Indian Express",
    "summary": "WHO launches 'Global Specs 2030' to ensure affordable eyecare for 800M+ people globally, focusing on youth as change catalysts for vision health.",
    "link": "post-30.html",
    "resource_link": "https://indianexpress.com/article/lifestyle/health/who-initiative-to-ensure-affordable-eyecare-services-for-all-by-2030-10150269/"
},
    {
    "id": "29",
    "title": "RBI Governor on Fed, Inflation, and Economy",
    "date": "2025-07-26",
    "subject": "Economy",
    "source": "Indian Express",
    "summary": "RBI Governor praised US Fed's independence, affirmed continuous inflation war despite recent moderation, and discussed monetary policy, credit growth, and trade deals.",
    "link": "post-29.html",
    "resource_link": "https://indianexpress.com/article/business/rbi-governor-sanjay-malhotra-us-fed-chair-doing-good-job-central-bank-independence-important-10150268/#:~:text=AMID%20THE%20ongoing%20feud%20between,doing%20a%20very%20good%20job."
},
    {
    "id": "28",
    "title": "Europe, Iran Meet Amidst Nuclear Deadlock & Sanctions Threat",
    "date": "2025-07-26",
    "subject": "International Relations",
    "source": "Indian Express",
    "summary": "Europe and Iran meet in Istanbul to discuss nuclear deadlock and potential sanctions snapback, amidst Israeli-US strikes and Iran's uranium enrichment.",
    "link": "post-28.html",
    "resource_link": "https://indianexpress.com/article/world/iran-europe-nuclear-talks-istanbul-sanctions-deadlock-10148869/"
},
    {
        "id": "27",
        "title": "France to Recognise Palestinian State, Draws Fire",
        "date": "2025-07-26",
        "subject": "International Relations",
        "source": "The Hindu",
        "summary": "France plans to recognise a Palestinian state at UNGA, drawing strong condemnation from Israel and the US, who view it as rewarding terror.",
        "link": "post-27.html",
        "resource_link": "https://www.thehindu.com/news/international/french-plan-to-recognise-palestinian-state-draws-fire-from-israel-us/article68450500.ece"
    },
    {
        "id": "26",
        "title": "Consensual Sex (16-18) Not Abuse: SC Amicus Curiae",
        "date": "2025-07-26",
        "subject": "Polity & Governance, Social Issues",
        "source": "The Hindu",
        "summary": "SC amicus curiae argues consensual sex between 16-18 year olds shouldn't be criminalized under POCSO, advocating a 'close-in-age exception' to protect adolescent relationships.",
        "link": "post-26.html",
        "resource_link": "https://www.thehindu.com/news/national/consensual-sex-between-adolescents-aged-16-to-18-must-not-be-treated-as-abuse/article68450123.ece"
    },
    {
        "id": "25",
        "title": "Draft Data Protection Rules Receive Over 6,900 Inputs",
        "date": "2025-07-26",
        "subject": "Polity & Governance, Science & Technology",
        "source": "Ministry of Electronics and Information Technology",
        "summary": "Draft Data Protection Rules received 6,915 inputs. Ministry confirmed consultations, emphasizing penalties for non-compliance, showing broad stakeholder engagement.",
        "link": "post-25.html",
        "resource_link": "https://www.thehindu.com/news/national/received-over-6900-inputs-on-draft-data-rules-ministry/article68450000.ece"
    },
    {
        "id": "24",
        "title": "66 Lakh Voters May Be Excluded from Draft Roll",
        "date": "2025-07-26",
        "subject": "Polity & Governance",
        "source": "Election Commission Data",
        "summary": "EC data indicates 66 lakh voters may miss draft electoral roll due to deceased, duplicate, or untraceable entries, sparking controversy and legal challenges.",
        "link": "post-24.html",
        "resource_link": "https://www.thehindu.com/news/national/66-lakh-voters-may-be-left-out-of-draft-roll-ec-data/article68449666.ece"
    },
    {
        "id": "23",
        "title": "Meghalaya HC Seeks Action Over Missing Coal",
        "date": "2025-07-26",
        "subject": "Polity & Governance, Environment",
        "source": "The Hindu",
        "summary": "Meghalaya High Court demands government action after 3,950 MT of illegally mined coal vanished from depots, citing accountability and illegal transportation concerns.",
        "link": "post-23.html",
        "resource_link": "https://www.thehindu.com/news/national/meghalaya-hc-seeks-govt-action-after-coal-vanishes-from-depots/article68449555.ece"
    },
    {
        "id": "22",
        "title": "Bihar's Debt Cycle: Microfinance & Harsh Recovery",
        "date": "2025-07-26",
        "subject": "Social Issues & Economy",
        "source": "The Hindu",
        "summary": "Bihar's poor face a severe debt trap from microfinance and informal loans, exacerbated by aggressive recovery agents, despite RBI guidelines, highlighting systemic flaws.",
        "link": "post-22.html",
        "resource_link": "https://www.thehindu.com/news/national/other-states/in-bihar-a-matter-of-life-and-debt/article68449000.ece"
    },
    {
        "id": "21",
        "title": "India-UK Trade Deal: A Template for Future Pacts",
        "date": "2025-07-26",
        "subject": "Economy & International Relations",
        "source": "The Hindu",
        "summary": "India-UK trade deal, a 'give and take' example, offers duty-free access for most goods. It sets a template for future EU and US agreements.",
        "link": "post-21.html",
        "resource_link": "https://www.thehindu.com/opinion/editorial/give-and-take-the-india-uk-trade-deal-may-set-the-template-for-the-eu-and-us-deals/article68448888.ece"
    },
    {
        "id": "20",
        "title": "AI Chip Developers Counter Allegations, Cite Centre's Support",
        "date": "2025-07-26",
        "subject": "Science & Technology",
        "source": "The Hindu",
        "summary": "Digital University Kerala's AI chip developers defend their invention as academic research, highlighting Centre's 'Chip to Startup' program support amidst transparency allegations.",
        "link": "post-20.html",
        "resource_link": "https://www.thehindu.com/sci-tech/technology/ai-chip-developers-hit-back-at-allegations-cite-support-from-centre/article12345678903.ece"
    },
    {
        "id": "19",
        "title": "185 Pak. Refugees Get Indian Citizenship Under CAA",
        "date": "2025-07-26",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "185 Pakistani refugees received Indian citizenship under CAA in Gujarat, ending years of uncertainty and granting them dignity, safety, and equal opportunities.",
        "link": "post-19.html",
        "resource_link": "https://www.thehindu.com/news/national/185-pak-refugees-get-indian-citizenship-under-caa/article12345678902.ece"
    },
    {
        "id": "18",
        "title": "Meghalaya Considers Mandatory Pre-Marriage HIV/AIDS Test",
        "date": "2025-07-25",
        "subject": "Social Issues & Health",
        "source": "The Hindu",
        "summary": "Meghalaya is considering mandatory pre-marriage HIV/AIDS testing due to alarming rising cases, particularly in East Khasi Hills. This aims to formulate a comprehensive state policy on HIV/AIDS.",
        "link": "post-18.html",
        "resource_link": "https://www.thehindu.com/news/national/meghalaya-pre-marriage-hivaids-test-mandatory/article12345678901.ece"
    },
    {
        "id": "17",
        "title": "Lok Sabha to take up motion to remove HC judge",
        "date": "2025-07-25",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "Lok Sabha will consider a bipartisan motion to remove Allahabad HC Justice Yashwant Varma due to a cash recovery controversy. The process follows the Judges (Inquiry) Act, involving an inquiry committee.",
        "link": "post-17.html",
        "resource_link": "https://www.thehindu.com/news/national/ls-to-take-up-motion-to-remove-hc-judge/article1234567890.ece"
    },
    {
        "id": "16",
        "title": "India-UK Trade Pact: A Template for Future Deals",
        "date": "2025-07-25",
        "subject": "Economy & International Relations",
        "source": "Indian Express",
        "summary": "India and the UK signed a comprehensive trade deal to double bilateral trade. It lowers India's tariffs significantly while giving Indian exports duty-free access to the UK, aiming to deepen economic ties.",
        "link": "post-16.html",
        "resource_link": "https://indianexpress.com/article/opinion/editorials/india-uk-trade-pact-a-template-for-deals-with-america-and-europ-10147850/"
    },
    {
        "id": "15",
        "title": "Why a Strong Rouble is a Double-Edged Sword for Russia",
        "date": "2025-07-25",
        "subject": "Economy & International Relations",
        "source": "Reuters",
        "summary": "The Russian rouble's rise, driven by tight policy and peace hopes, is a double-edged sword. While signaling economic strength, it cuts budget revenues and hurts exporters, posing challenges despite the central bank's inflation fight.",
        "link": "post-15.html",
        "resource_link": "https://www.reuters.com/markets/currencies/why-strong-rouble-is-double-edged-sword-russia-2025-07-25/"
    },
    {
        "id": "14",
        "title": "Unpacking National Sports Governance Bill",
        "date": "2025-07-25",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "Detailed analysis of the National Sports Governance Bill, including the proposed National Sports Board and Tribunal, its need, implications for judicial intervention, and impact on bodies like BCCI.",
        "link": "post-14.html",
        "resource_link": "https://www.thehindu.com/sport/national-sports-governance-bill-now-in-ls/article123456789.ece"
    },
    {
        "id": "13",
        "title": "Lorem",
        "date": "2025-07-25",
        "subject": "Economy & Technology",
        "source": "The Economic Times",
        "summary": "India is making significant strides in its semiconductor mission, aiming to establish a robust ecosystem for chip manufacturing and design. This initiative is crucial for technological self-reliance and economic growth, attracting major global players.",
        "link": "post-13.html",
        "resource_link": "https://economictimes.indiatimes.com/news/economy/policy/india-semiconductor-mission-a-strategic-push/articleshow/100000001.cms"
    },
    {
        "id": "12",
        "title": "Sports Development: India's Preparations for Global Events",
        "date": "2025-07-14",
        "subject": "Sports & Youth Affairs",
        "source": "Sports Authority of India (SAI)",
        "summary": "India's preparations for upcoming major global sporting events are in full swing. This post highlights the government's initiatives to promote sports, identify talent, and provide world-class training facilities.",
        "link": "post-12.html",
        "resource_link": "https://sportsauthorityofindia.nic.in/schemes-programmes"
    },
    {
        "id": "11",
        "title": "Wildlife Conservation: Project Tiger's New Phase",
        "date": "2025-07-15",
        "subject": "Environment & Biodiversity",
        "source": "Ministry of Environment, Forest and Climate Change",
        "summary": "Project Tiger enters a new phase with enhanced conservation strategies and expanded protected areas. The initiative aims to further boost tiger populations and preserve critical habitats across India.",
        "link": "post-11.html",
        "resource_link": "https://moef.gov.in/project-tiger/"
    },
    {
        "id": "10",
        "title": "Judicial Reforms: Expediting Justice Delivery",
        "date": "2025-07-16",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "Discussions on ongoing judicial reforms aimed at reducing pendency and expediting justice delivery in India. Key areas include digitalization of courts, alternative dispute resolution mechanisms, and judicial appointments.",
        "link": "post-10.html",
        "resource_link": "https://www.thehindu.com/news/national/judicial-reforms/article12345678.ece"
    },
    {
        "id": "9",
        "title": "Urban Development: Smart Cities Mission Update",
        "date": "2025-07-17",
        "subject": "Urban Planning & Infrastructure",
        "source": "Ministry of Housing and Urban Affairs",
        "summary": "An update on the Smart Cities Mission, showcasing successful projects and ongoing initiatives to transform urban landscapes. The focus is on sustainable development, citizen-centric services, and technological integration.",
        "link": "post-9.html",
        "resource_link": "https://smartcities.gov.in/content/"
    },
    {
        "id": "8",
        "title": "Healthcare Reforms: Focus on Ayushman Bharat",
        "date": "2025-07-18",
        "subject": "Social Issues & Health",
        "source": "Ministry of Health & Family Welfare",
        "summary": "Recent reforms in India's healthcare sector emphasize strengthening the Ayushman Bharat scheme. The aim is to expand coverage, improve access to quality healthcare, and enhance public health infrastructure.",
        "link": "post-8.html",
        "resource_link": "https://pmjay.gov.in/"
    },
    {
        "id": "7",
        "title": "Digital Public Infrastructure (DPI) in India: A Global Model",
        "date": "2025-07-19",
        "subject": "Governance & Technology",
        "source": "NITI Aayog",
        "summary": "India's Digital Public Infrastructure (DPI) model, encompassing Aadhaar, UPI, and DigiLocker, is gaining international recognition. This article explores how DPI is transforming governance and service delivery.",
        "link": "post-7.html",
        "resource_link": "https://www.niti.gov.in/digital-public-infrastructure"
    },
    {
        "id": "6",
        "title": "Renewable Energy Targets: Progress and Challenges",
        "date": "2025-07-20",
        "subject": "Environment & Energy",
        "source": "Ministry of New and Renewable Energy",
        "summary": "An assessment of India's progress towards its ambitious renewable energy targets. The report highlights achievements in solar and wind power, alongside the challenges in grid integration and energy storage.",
        "link": "post-6.html",
        "resource_link": "https://mnre.gov.in/achievements"
    },
    {
        "id": "5",
        "title": "India's Foreign Policy: Engaging with the Global South",
        "date": "2025-07-21",
        "subject": "International Relations",
        "source": "Ministry of External Affairs, GoI",
        "summary": "India's proactive engagement with countries of the Global South is a cornerstone of its foreign policy. Discussions focus on strengthening economic ties, fostering multilateral cooperation, and addressing shared challenges.",
        "link": "post-5.html",
        "resource_link": "https://www.mea.gov.in/foreign-policy.htm"
    },
    {
        "id": "4",
        "title": "Space Exploration: ISRO's Upcoming Missions",
        "date": "2025-07-22",
        "subject": "Science & Technology",
        "source": "ISRO Official Website",
        "summary": "The Indian Space Research Organisation (ISRO) unveils its ambitious roadmap for upcoming space missions, including lunar probes, solar observations, and advancements in satellite technology, reinforcing India's position in global space exploration.",
        "link": "post-4.html",
        "resource_link": "https://www.isro.gov.in/upcoming-missions"
    },
    {
        "id": "3",
        "title": "New Education Policy (NEP) 2020: Implementation Progress",
        "date": "2025-07-23",
        "subject": "Social Issues & Education",
        "source": "Ministry of Education, GoI",
        "summary": "An overview of the progress and challenges in implementing the National Education Policy (NEP) 2020. Focus areas include curriculum reforms, digital education integration, and skill development initiatives.",
        "link": "post-3.html",
        "resource_link": "https://www.education.gov.in/nep"
    },
    {
        "id": "2",
        "title": "Monsoon Forecast 2025: Implications for Agriculture",
        "date": "2025-07-24",
        "subject": "Geography & Agriculture",
        "source": "India Meteorological Department (IMD)",
        "summary": "The latest monsoon forecast for 2025 indicates a normal to above-normal rainfall, which is a positive sign for the agricultural sector. Experts discuss the potential impact on crop yields and food security across various regions.",
        "link": "post-2.html",
        "resource_link": "https://mausam.imd.gov.in/imd_latest/contents/press_release_details.php?id=12345"
    },
    {
        "id": "1",
        "title": "India's Semiconductor Mission: A Strategic Push",
        "date": "2025-07-25",
        "subject": "Economy & Technology",
        "source": "The Economic Times",
        "summary": "India is making significant strides in its semiconductor mission, aiming to establish a robust ecosystem for chip manufacturing and design. This initiative is crucial for technological self-reliance and economic growth, attracting major global players.",
        "link": "post-1.html",
        "resource_link": "https://economictimes.indiatimes.com/news/economy/policy/india-semiconductor-mission-a-strategic-push/articleshow/100000001.cms"
    }
]
