[
    
{
    "id": "161",
    "title": "NISAR Mission: ISRO-NASA Collaboration",
    "date": "2025-08-17",
    "subject": "Science & Technology, Space, Environment, Disaster Management",
    "source": "Indian Express",
    "summary": "This article details the NISAR mission, a collaboration between ISRO and NASA. It outlines the mission's objectives to study Earth's landforms, its key features like the L-band and S-band SAR systems, and its significance for disaster management and climate monitoring. The analysis highlights key UPSC-relevant topics such as international cooperation in space technology and its contribution to scientific and strategic capabilities.",
    "link": "post-161.html",
    "resource_link": "161.png"
},
    {
    "id": "160",
    "title": "Eco-sensitive Western Ghats: Hindalco Bauxite Mine, Kolhapur",
    "date": "2025-08-17",
    "subject": "Polity, Governance, Social Issues, Ethics",
    "source": "Indian Express",
    "summary": "This article details the decision of the Forest Advisory Committee (FAC) to decline final approval for Hindalco Industries Ltd’s bauxite mine in Kolhapur, Maharashtra, due to its location within Eco-Sensitive Areas (ESA) of the Western Ghats and other regulatory issues. It highlights the conflict between industrial development and environmental conservation, relevant for UPSC aspirants.",
    "link": "post-160.html",
    "resource_link": "1.png"
},
    {
    "id": "159",
    "title": "Jan Vishwas 2.0: Overview of Proposed Bill (2025)",
    "date": "2025-08-17",
    "subject": "Polity, Governance, Social Issues, Ethics",
    "source": "Indian Express",
    "summary": "This article provides a comprehensive overview of the proposed Jan Vishwas (Amendment of Provisions) Bill, 2025. It details the bill's key features, such as the 'improvement notice' mechanism, rationalized penalty structures, and its objective to decriminalize minor offenses. It also explains its significance for UPSC aspirants, touching upon themes like ease of doing business, legal reforms, and trust-based governance. The article contrasts the new provisions with the Jan Vishwas Act of 2023, offering a clear perspective on this legislative reform. The content is presented in both English and Hindi to cater to a diverse audience.",
    "link": "post-159.html",
    "resource_link": "159.png"
},
    {
    "id": "158",
    "title": "Encounter of Surya Hansda: Tribal Welfare Leader Killed in Jharkhand",
    "date": "2025-08-17",
    "subject": "Polity, Governance, Social Issues, Ethics",
    "source": "Indian Express",
    "summary": "This article details the controversial police 'encounter' killing of Surya Hansda, a tribal leader and social worker from Jharkhand. It outlines his background in social work and politics, the police narrative versus family accounts of his death, and the subsequent political and legal responses. The analysis highlights key UPSC-relevant topics such as tribal rights, police accountability, rule of law, and the role of grassroots leaders in education.",
    "link": "post-158.html",
    "resource_link": "158.png"
},
    {
    "id": "157",
    "title": "SC Collegium cannot dictate names to HC Collegiums: CJI",
    "date": "2025-08-16",
    "subject": "Polity, Governance, Federalism, Judicial System",
    "source": "The Hindu",
    "summary": "CJI B.R. Gavai clarifies that the Supreme Court Collegium cannot dictate names to High Court Collegiums for judicial appointments, reinforcing the principle of judicial federalism and the autonomy of High Courts. The article highlights the issue of vacancies in High Courts and pending recommendations with the central government, emphasizing the need for judicial independence and a decentralized appointment process. It is highly relevant for UPSC CSE aspirants studying Indian Polity and Governance.",
    "link": "post-157.html",
    "resource_link": "157.png"
},
    {
    "id": "156",
    "title": "The day a village in Uttarkashi disappeared: A UPSC CSE Analysis",
    "date": "2025-08-16",
    "subject": "Disaster Management, Environment & Ecology, Governance, Social Issues",
    "source": "The Hindu",
    "summary": "This article analyzes the devastating landslide and flash flood that caused the disappearance of the village Dharali in Uttarkashi, Uttarakhand. It examines the disaster's triggers, human and environmental impacts, rescue challenges, and broader implications for UPSC CSE aspirants, including recurring disaster themes, policy failures, and the critical need for sustainable development in the fragile Himalayan ecosystem.",
    "link": "post-156.html",
    "resource_link": "156.png"
},
    {
    "id": "155",
    "title": "Presumed Consent for Organ Donation",
    "date": "2025-08-16",
    "subject": "GS Paper II, Governance, Social Justice, Health, Ethics, Ethical Dilemmas, Public Policy",
    "source": "Hindustan Times",
    "summary": "This article provides a comprehensive UPSC-focused analysis of the 'presumed consent' or 'opt-out' model for organ donation. It explores the reasons for India's low donation rate, examines the arguments for and against the presumed consent model, and proposes a balanced way forward. The article highlights the ethical, social, and legal complexities of the policy in the Indian context, making it a valuable resource for civil services aspirants.",
    "link": "post-155.html",
    "resource_link": "155.png"
},
    {
    "id": "154",
    "title": "Highlights from PM's 79th Independence Day Address",
    "date": "2025-08-16",
    "subject": "GS Paper II, Governance, constitutional reforms, self-reliance, federalism (GST). GS Paper III, Economy (GST, tax, fiscal policy), defence, space, renewable energy, agriculture, employment. GS Paper I, Poverty alleviation, social justice, women empowerment, cultural heritage.",
    "source": "pmindia.gov.in",
    "summary": "This article summarizes the key highlights from PM Modi's 79th Independence Day speech, which outlined a comprehensive vision for 'Viksit Bharat 2047.' The address focused on themes of self-reliance, innovation, economic reforms (including the new GST regime), national security, and social welfare, with specific policies and goals across various sectors like defence, agriculture, and technology. It is a critical resource for UPSC CSE aspirants.",
    "link": "post-154.html",
    "resource_link": "https://www.pmindia.gov.in/en/news_updates/highlights-from-the-pms-address-on-the-79th-independence-day/?comment=disable"
},
    {
    "id": "153",
    "title": "Diwali Gift for Aam Aadmi: Two-Tier GST Regime by October",
    "date": "2025-08-16",
    "subject": "GS Paper III, Indian Economy, taxation, reforms, fiscal policy, consumption boost.",
    "source": "Financial Express",
    "summary": "Prime Minister Modi announced a major GST revamp, proposing a two-tier system with rates of 5% and 18% for most goods. This reform aims to simplify the tax structure, reduce the burden on consumers, and boost economic activity by making essentials and aspirational goods cheaper. However, its success depends on addressing challenges like potential state revenue losses and ensuring a smooth implementation.",
    "link": "post-153.html",
    "resource_link": "153.png"
},
    {
    "id": "152",
    "title": "No Matter What Sex, a Couple is a Couple",
    "date": "2025-08-16",
    "subject": "Polity, Governance, Social Issues, Ethics, Federalism",
    "source": "Economic Times",
    "summary": "This article discusses the legal and social challenges faced by LGBTQI couples in India despite the decriminalization of homosexuality. It covers issues like financial inequities, lack of inheritance rights, and the ongoing debate between the judiciary and legislature regarding marriage equality. The notes are tailored for UPSC CSE aspirants, providing a comprehensive overview of the topic for various papers and essays.",
    "link": "post-152.html",
    "resource_link": "152.png"
},
    {
    "id": "151",
    "title": "Rejection of Minorities Commission - A Visible Sign of Insecurity",
    "date": "2025-08-13",
    "subject": "Polity, Governance, Social Issues, Ethics, Federalism",
    "source": "The Goan",
    "summary": "This article analyzes the Goa government's rejection of a State Minorities Commission, despite constitutional provisions and public demand. It examines the government's reasoning, constitutional and legal backgrounds, and highlights contradictions in its messaging. The notes delve into the broader implications for secularism and social trust, the role of such commissions, and a way forward for inclusive governance. It is designed to be directly useful for UPSC CSE aspirants.",
    "link": "post-151.html",
    "resource_link": "https://www.thegoan.net/editorial/%EF%BB%BFrejection-of-minorities-commission-a-visible-sign-of-insecurity/134707.html#:~:text=The%20State%20government%27s%20reluctance%20to,display%20elsewhere%20in%20the%20country."
}, 
{
    "id": "150",
    "title": "How Delhi HC's Recent Crocs Verdict Undermines India's IP Framework",
    "date": "2025-08-13",
    "subject": "Law, Judiciary, Governance, IPR, Economics",
    "source": "The Daily Guardian",
    "summary": "This article provides a detailed analysis of the Delhi High Court's Crocs verdict, which rejected the company's appeal for design infringement. It explores the legal framework of the Designs Act and Trademarks Act, the key judicial reasoning in the case, and the logical flaws in the decision. The document also highlights international precedents, why the verdict is seen as detrimental to innovation, and its relevance for UPSC CSE aspirants, including a section on a related voter list dispute for a broader understanding of governance issues.",
    "link": "post-150.html",
    "resource_link": "150.png"
},
    {
    "id": "149",
    "title": "Youth Empowerment through Suffrage and Mandatory Military Service",
    "date": "2025-08-13",
    "subject": "Governance, Social Issues, National Security, Politics",
    "source": "The Statesman",
    "summary": "This article explores two reforms proposed for youth empowerment in India: lowering the voting age to 16 and implementing a mandatory 6-12 month military service. It outlines the benefits, global examples, legal basis in India, and potential challenges for each proposal. The notes are structured to be directly useful for UPSC CSE aspirants, covering key terms and relevance to various general studies papers.",
    "link": "post-149.html",
    "resource_link": "https://www.thestatesman.com/opinion/a-theme-for-youth-1503470753.html"
},
    {
    "id": "148",
    "title": "Why Narratives Matter More Than Maps",
    "date": "2025-08-13",
    "subject": "Geopolitics, International Relations, Media",
    "source": "The Pioneer",
    "summary": "This article discusses the growing importance of narratives over traditional geopolitical factors like military power and geography. It explores the evolution of geostrategic communication from the traditional era to the digital age, outlines key instruments used today, and highlights challenges like disinformation and the digital divide. The document also emphasizes the criticality of media literacy and provides strategic recommendations for strengthening a nation's communication capacity.",
    "link": "post-148.html",
    "resource_link": "https://www.dailypioneer.com/2025/columnists/why-narratives-matter-more-than-maps.html"
},
    {
    "id": "147",
    "title": "Major Reforms for Doubling Farmers' Income",
    "date": "2025-08-13",
    "subject": "Governance, Economy, Agriculture, Schemes",
    "source": "Press Information Bureau (PIB)",
    "summary": "This article details the comprehensive, integrated strategy adopted by the Government of India to double farmers' income. It outlines the six key pillars of this strategy and lists various major schemes and programs focused on income support, risk management, market access, diversification, and innovation. The document also highlights the relevance of these reforms for UPSC CSE aspirants.",
    "link": "post-147.html",
    "resource_link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2155531"
},
    {
    "id": "146",
    "title": "National Policy Framework on Agriculture and Marketing (NPFAM)",
    "date": "2025-08-13",
    "subject": "Governance, Economy, Agriculture",
    "source": "Press Information Bureau (PIB)",
    "summary": "This article outlines the National Policy Framework on Agriculture and Marketing (NPFAM) and its key initiatives like e-NAM, MSP, and PM-AASHA. It details how these policies aim to strengthen the agricultural marketing ecosystem, empower farmers, and support the 'One Nation, One Market' concept. The document also highlights the relevance of these topics for UPSC CSE aspirants.",
    "link": "post-146.html",
    "resource_link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2155536"
},
    {
    "id": "145",
    "title": "Cabinet Approves 4 New Semiconductor Manufacturing Units - Odisha, Punjab & Andhra Pradesh",
    "date": "2025-08-13",
    "subject": "Governance, Economy, Taxation, Law",
    "source": "Press Information Bureau (PIB)",
    "summary": "The Union Cabinet has approved four new semiconductor manufacturing projects under the India Semiconductor Mission (ISM) with an outlay of ₹4,600 crore. This article details the projects, including the first commercial compound semiconductor fab in India, their applications in sectors like defense and EVs, and their significance for India's strategic autonomy and economic growth. It also highlights related government initiatives and the relevance of this development for UPSC CSE aspirants.",
    "link": "post-145.html",
    "resource_link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2155456"
},
    {
    "id": "144",
    "title": "CPI Inflation Eases to 8-Year Low - July 2025",
    "date": "2025-08-13",
    "subject": "Governance, Economy, Taxation, Law",
    "source": "Financial Express",
    "summary": "This article discusses the easing of CPI inflation to an 8-year low in July 2025. It highlights the key data points released by MoSPI, major drivers for the decline, and its significance for the economy. The document also explores the potential impact on monetary policy and economic growth, concluding with an analysis of the article's relevance for UPSC CSE aspirants, including key terms.",
    "link": "post-144.html",
    "resource_link": "127.png"
},
    {
    "id": "143",
    "title": "Lok Sabha Passes Income Tax (No. 2) Bill, 2025",
    "date": "2025-08-12",
    "subject": "Governance, Economy, Taxation, Law",
    "source": "The Hindu",
    "summary": "This article discusses the Lok Sabha's passage of the Income Tax (No. 2) Bill, 2025. It highlights the Bill's aim to simplify the Income Tax Act, 1961, while also significantly broadening the powers of income tax officials to access personal digital data during search and seizure operations. The document outlines the key changes, the debate around the new provisions, and the potential implications for citizens' right to privacy versus the government's need for effective tax enforcement. It concludes with an analysis of the Bill's relevance for UPSC CSE aspirants, including a practice question.",
    "link": "post-143.html",
    "resource_link": "126.png"
},
    {
    "id": "142",
    "title": "Google Antitrust Case - India",
    "date": "2025-08-12",
    "subject": "Governance, Economy, Competition Policy, Technology",
    "source": "User Provided Content",
    "summary": "This article details the ongoing Google antitrust case in India, which has now reached the Supreme Court. It outlines the Competition Commission of India’s (CCI) allegations of abuse of dominance by Google in the Android ecosystem through mandatory billing systems and app bundling. The article also presents Google’s defense, the NCLAT's partial upholding of the CCI's order, and the stakes for consumers, startups, and Google. It highlights the broader significance of the case for India's role in global digital regulation and its relevance for the UPSC CSE syllabus.",
    "link": "post-142.html",
    "resource_link": "125.png"
},
    {
    "id": "141",
    "title": "Reviving Civic Engagement in Health Governance - With MCQ",
    "date": "2025-08-12",
    "subject": "Governance, Health Policy, Social Empowerment, Ethics",
    "source": "The Hindu",
    "summary": "This article discusses the critical need to revive civic engagement in India's health governance, moving beyond a paternalistic 'beneficiary' model. It highlights the success of doorstep healthcare initiatives in states like Tamil Nadu and Karnataka, while questioning the meaningfulness of citizen participation. The article examines existing institutional mechanisms, challenges, and proposes a two-pronged approach to empower communities and sensitize health system actors. It argues that meaningful participation is vital for enhancing accountability, building trust, and ensuring health governance truly serves the public, rather than just meeting targets.",
    "link": "post-141.html",
    "resource_link": "124.png"
},
    {
    "id": "140",
    "title": "A Court Ruling with No Room for Gender Justice  - With MCQ",
    "date": "2025-08-12",
    "subject": "Polity & Governance, Role of Judiciary, Gender Justice, Vulnerable Sections",
    "source": "The Hindu",
    "summary": "This article critically examines a Supreme Court ruling (Shivangi Bansal vs Sahib Bansal) which endorsed a 'cool-off period' for arrests under Section 498-A IPC. The judgment, which applies even with strong evidence, raises significant concerns about gender justice, victim safety, and the uniformity of criminal law. The article discusses the rationale behind the order, a history of the 'misuse' debate, and its implications for women's rights.",
    "link": "post-140.html",
    "resource_link": "123.png"
},
    {
    "id": "139",
    "title": "Supreme Court Orders Capture of Stray Dogs in Delhi",
    "date": "2025-08-12",
    "subject": "Governance, Welfare Schemes, Urban Administration, Animal Welfare, Public Safety",
    "source": "The Hindu",
    "summary": "The Supreme Court has directed the Delhi government and civic bodies to capture and not release stray dogs back onto public streets. This order, prompted by rising incidents of dog attacks, emphasizes public safety over sentimental considerations and highlights the need for immediate action, infrastructure development, and transparent monitoring.",
    "link": "post-139.html",
    "resource_link": "122.png"
},
    {
    "id": "138",
    "title": "Message from Eastern States in President's 'At Home' Invite - Independence Day 2025",
    "date": "2025-08-11",
    "subject": "GS Paper 1, GS Paper 2, GS Paper 3, Art & Culture, Governance, Economy",
    "source": "Indian Express",
    "summary": "This article highlights the special invitation kit designed for the President's 'At Home' event on Independence Day 2025. Focusing on the four Eastern states of Bihar, West Bengal, Odisha, and Jharkhand, the kit features traditional crafts like Madhubani art, sikki grass weaving, Pattachitra, and Talapatra Chitra. The initiative, curated in collaboration with NID and local artisans, is a form of cultural diplomacy that promotes regional art, women's empowerment, and rural livelihoods, aligning with President Droupadi Murmu's vision. The article also provides a glimpse into the regional menu and points out its relevance for the UPSC CSE syllabus.",
    "link": "post-138.html",
    "resource_link": "121.png"
},
    {
    "id": "137",
    "title": "Reviving the Yamuna Floodplains - Parks & Recreation",
    "date": "2025-08-11",
    "subject": "GS Paper 1, GS Paper 2, GS Paper 3,Geography, Governance, Environment",
    "source": "Indian Express",
    "summary": "This article details the multi-faceted effort to restore the 22-km stretch of the Yamuna floodplains between Wazirabad and Okhla in Delhi. It outlines key projects like the Yamuna and Kalindi Biodiversity Parks, the recreational Baansera Park, and the Amrut Biodiversity Park. The document highlights the legal framework from the NGT, challenges such as encroachments and maintenance gaps, and the ecological and social significance of these projects. It also provides a way forward and its relevance for UPSC CSE, covering topics from geography and environment to governance and urban planning.",
    "link": "post-137.html",
    "resource_link": "120.png"
},
    {
    "id": "136",
    "title": "Uttarkashi Flash Floods - Dharali Tragedy",
    "date": "2025-08-11",
    "subject": "GS Paper 2, Social Justice, Governance",
    "source": "Indian Express",
    "summary": "This article details the flash floods in Dharali, Uttarkashi on August 5, 2025, which left approximately 60 people missing. It covers the human impact, rescue operations challenges, and issues highlighted such as the perceived neglect of locals in favor of tourists. The article also discusses the broader significance of the disaster for disaster management in the Himalayas and its relevance for UPSC CSE, covering topics in GS Paper I, II, and III.",
    "link": "post-136.html",
    "resource_link": "119.png"
},
    {
    "id": "135",
    "title": "Welfare of Senior Citizens: Kerala's Draft Policy for Elder Persons, 2025",
    "date": "2025-08-10",
    "subject": "GS Paper 2, Social Justice, Governance",
    "source": "The Hindu",
    "summary": "This article discusses the Kerala State Policy for Elder Persons, 2025, which aims to replace the 2013 policy with a rights-based approach. The policy addresses a rapidly aging population, with key provisions on combating elder abuse, promoting active and productive aging through skill registries and intergenerational engagement, and ensuring social and financial security. It is seen as a progressive model that could be replicated by other states and aligns with the constitutional mandate under Article 41. The article also highlights implementation challenges and the broader shift from a welfare to a rights-based framework.",
    "link": "post-135.html",
    "resource_link": "118.png"
},
    {
    "id": "134",
    "title": "'Untouchability Wall' Demolished in Karur, Tamil Nadu",
    "date": "2025-08-10",
    "subject": "GS Paper 1, Indian Society, GS Paper 2, Governance, GS Paper 4, Ethics",
    "source": "Indian Express",
    "summary": "This article reports on the demolition of an 'untouchability wall' in Muthuladampatti, Karur, Tamil Nadu. The wall was allegedly built by the Thottia Naicker community to restrict access for the Arunthathiyar (SC) community. The piece details the background of the caste-based dispute, the timely intervention of the Revenue Department and police, and the voluntary demolition of the wall by the intermediate caste community. It highlights the social significance of the event as a symbolic act against discrimination and discusses the legal aspects, including the violation of public land rights and the applicability of constitutional provisions like Article 17.",
    "link": "post-134.html",
    "resource_link": "117.png"
},
    {
    "id": "133",
    "title": "India-US Trade Relations and Global Protectionism",
    "date": "2025-08-10",
    "subject": "GS Paper 2, International Relations, GS Paper 3, Indian Economy",
    "source": "Indian Express",
    "summary": "This article provides a historical and contemporary analysis of India-US trade relations amidst a new wave of global protectionism. It traces India's shift from a pre-1991 protectionist economy to its post-1991 liberalization and global integration. The piece highlights the paradox of traditional free trade proponents like the US adopting protectionist policies under President Trump and weaponizing tariffs. It details specific trade tensions, including the US imposing a 50% base tariff on certain Indian goods. The article concludes with India's strategic response and a way forward, emphasizing negotiation, market diversification, and domestic reforms to counter these challenges.",
    "link": "post-133.html",
    "resource_link": "116.png"
},
    {
    "id": "132",
    "title": "Operation Sindoor's 300-km Kill: Indian Air Force's Rare Long-Range Engagement",
    "date": "2025-08-10",
    "subject": "GS Paper 2, International Relations, GS Paper 3, Security & Defence Technology",
    "source": "Indian Express",
    "summary": "This article discusses Operation Sindoor, where the Indian Air Force (IAF) reportedly achieved a 300-km long-range kill of a Pakistani airborne platform. The piece highlights the significance of this event as a potential record for modern air warfare and details the weapon system involved, likely the S-400 Triumf missile. It explores the strategic importance of such a capability, including its role in extending India's air defense shield and preventing the use of long-range glide bombs. The article also touches on the technical background, comparisons with other conflicts, and the diplomatic context, particularly concerning the US's CAATSA sanctions.",
    "link": "post-132.html",
    "resource_link": "115.png"
},
    {
    "id": "131",
    "title": "India's Ethanol Blending Programme (EBP) for Sustainable Development",
    "date": "2025-08-10",
    "subject": "Environment, Science & Technology, Economy",
    "source": "Indian Express",
    "summary": "This article provides an in-depth analysis of India's Ethanol Blending Programme (EBP), highlighting its role in achieving energy security and sustainable development. It covers the country's success in meeting the E20 blending target ahead of schedule and its future goals. The piece delves into the key objectives, such as reducing crude oil import dependency and improving air quality, and discusses the socio-economic impact on farmers. It also outlines the policy framework, including the National Policy on Biofuels and various support measures, while addressing challenges like the 'food vs. fuel' debate and infrastructure gaps. Recommendations for the way forward, including the adoption of second-generation (2G) ethanol and flex-fuel vehicles, are also included.",
    "link": "post-131.html",
    "resource_link": "114.png"
},
    {
    "id": "130",
    "title": "Consumer Protection and Dispute Redressal in India",
    "date": "2025-08-10",
    "subject": "GS Paper 2, Governance, Policies & Interventions",
    "source": "Indian Express",
    "summary": "This article explores the challenges plaguing India's consumer grievance redressal system. It highlights a significant backlog of cases, stagnant disposal rates, and a deviation from the timelines set by the Consumer Protection Act. Key issues discussed include widespread vacancies in consumer commissions, procedural delays, low public trust, and a lack of proper infrastructure. The article concludes with a set of recommendations, including filling vacant posts, streamlining procedures, promoting mediation, and increasing consumer awareness to improve the system's efficiency.",
    "link": "post-130.html",
    "resource_link": "113.png"
},
    {
    "id": "129",
    "title": "Tamil Nadu's Textile Belt and US's 50% Tariff Impact",
    "date": "2025-08-10",
    "subject": "Indian Economy, International Relations",
    "source": "Indian Express",
    "summary": "This article discusses the significant impact of the US's new 50% tariff on certain Indian textile exports, which is much higher than tariffs on regional competitors. It focuses on the economic repercussions for Tamil Nadu's textile hubs (Tiruppur, Coimbatore, Karur), including export order losses, job risks, and a competitive disadvantage. The piece also outlines the industry’s concerns regarding low margins and existing domestic cost pressures, along with their demands for policy relief, tax reforms, and diplomatic action to mitigate the crisis.",
    "link": "post-129.html",
    "resource_link": "112.png"
},
    {
    "id": "128",
    "title": "The Bihar migrant worker, a Scylla-Charybdis moment",
    "date": "2025-08-08",
    "subject": "Governance, Social Justice, Electoral Reforms",
    "source": "The Hindu",
    "summary": "This article discusses the dilemma faced by Bihar's migrant workers whose names are being dropped from electoral rolls during a special revision. They are caught between being disenfranchised in their home constituency and the legal, social, and political hurdles of registering elsewhere. The piece explores key concepts like 'ordinarily resident,' the conflict between the right to vote and the right to reside, and potential solutions like RVMs and legislative amendments to address this issue.",
    "link": "post-128.html",
    "resource_link": "111.png"
},
    {
    "id": "127",
    "title": "The Uttar Pradesh School Merger Controversy",
    "date": "2025-08-08",
    "subject": "Governance, Social Justice, Education",
    "source": "The Hindu",
    "summary": "This article details the controversy surrounding the Uttar Pradesh government's plan to merge over 10,000 primary and upper primary schools. It examines the government's rationale based on the NEP-2020 and the SATH-E project, as well as the strong opposition from parents, students, and teachers. Key issues include increased travel distance, safety risks, potential dropout rates among marginalized communities, and concerns about job cuts and judicial intervention by the Allahabad High Court.",
    "link": "post-127.html",
    "resource_link": "110.png"
},
    {
    "id": "126",
    "title": "Mumbai Train Blasts Acquittal: A Critical Look at India's Criminal Justice System",
    "date": "2025-08-07",
    "subject": "Governance, Social Justice, Indian Constitution",
    "source": "The Hindu",
    "summary": "This article analyzes the Bombay High Court's recent decision to acquit all 12 individuals convicted in the 2006 Mumbai train blasts case. It examines the key flaws in the investigation and trial process, such as unreliable evidence and coerced confessions, that led to the verdict. The analysis also highlights the role of the Right to Information (RTI) Act and the constitutional principle of the right against self-incrimination (Article 20(3)). The piece is framed to help UPSC aspirants understand the systemic challenges within India's criminal justice system and the urgent need for judicial and police reforms.",
    "link": "post-126.html",
    "resource_link": "109.png"
},
    {
    "id": "125",
    "title": "Chinese Engineers' Departure: A Geo-economic Manoeuvre Against India's Manufacturing",
    "date": "2025-08-07",
    "subject": "International Relations, Economy, Governance",
    "source": "The Hindu",
    "summary": "This article analyzes the recent withdrawal of Chinese engineers from Foxconn's facilities in India, framing it as a deliberate geo-economic strategy by Beijing to impede India's manufacturing growth. It explores China's domestic economic compulsions, its use of overcapacity as a weapon, and India's own strengths and challenges. The piece offers a UPSC-focused perspective on how India can build strategic autonomy and counter such moves through robust domestic reforms and a proactive diplomatic strategy.",
    "link": "post-125.html",
    "resource_link": "108.png"
},
    {
    "id": "124",
    "title": "Supreme Court Seeks ECI Response on Bihar Voter Deletions",
    "date": "2025-08-07",
    "subject": "Polity, Governance, Elections",
    "source": "The Hindu",
    "summary": "The Supreme Court has asked the Election Commission of India (ECI) for a detailed response regarding the deletion of approximately 65 lakh voters from the draft electoral rolls for Bihar. The article covers the background of the special intensive revision, the petitioner's concerns about the lack of specific reasons for each deletion, and the Supreme Court's key observations emphasizing the need for transparency and the voter's right to information. It also touches upon the legal, constitutional, ethical, and governance implications of the issue, as well as related precedents and the way forward from a UPSC perspective.",
    "link": "post-124.html",
    "resource_link": "107.png"
},
    {
  "id": "123",
  "title": "A Tribute to Shibu Soren: The Architect of Jharkhand",
  "date": "2025-08-07",
  "subject": "Governance, Social Justice, Constitution",
  "source": "The Hindu",
  "summary": "This article examines the recent Supreme Court verdict on naming government welfare schemes after living personalities, a topic highly relevant for UPSC aspirants. It delves into the court's observations, the constitutional principles at play, and the ethical implications for governance. The analysis is framed to help candidates understand critical issues surrounding judicial overreach, separation of powers, and the nuances of public policy.",
  "link": "post-123.html",
  "resource_link": "106.png"
},
    {
    "id": "122",
    "title": "IAF's Fighter Fleet Modernization and Challenges",
    "date": "2025-08-05",
    "subject": "GS-III, Security, Defence, Indigenization of Technology",
    "source": "The Hindu",
    "summary": "This article examines the Indian Air Force's decision to retire its last MiG-21 fighter jets, highlighting the resulting challenges. It discusses the declining number of fighter squadrons against the sanctioned strength, delays in the induction of indigenous aircraft like the LCA-Mk1A, and the broader strategic need to modernize the fleet. The article provides a detailed overview of current and future programs like the LCA-Mk2, AMCA, and SU-30MKI, outlining the strategic solutions required to fill the capability gap and ensure India's aerial defense readiness.",
    "link": "post-122.html",
    "resource_link": "105.png"
},
    {
    "id": "121",
    "title": "Battery Waste Management & EPR Floor Price Issue",
    "date": "2025-08-05",
    "subject": "GS Paper 3, Environment & Ecology, Indian Economy (Circular Economy)",
    "source": "The Hindu",
    "summary": "This article highlights a critical problem in India's battery waste management: a proposed low EPR (Extended Producer Responsibility) floor price that risks undermining the government's 2022 Battery Waste Management Rules (BWMR). It discusses the growth of lithium battery demand, environmental concerns, and the role of EPR. The article explains how an economically unviable floor price could incentivize fraudulent recyclers, leading to environmental degradation and significant economic loss. It provides a way forward by recommending a globally comparable EPR price, strengthening enforcement, and integrating the informal sector to ensure a sustainable circular economy for India.",
    "link": "post-121.html",
    "resource_link": "104.png"
},
    {
    "id": "120",
    "title": "A Tribute to Shibu Soren: The Architect of Jharkhand",
    "date": "2025-08-05",
    "subject": "Governance, Social Justice, Constitution",
    "source": "The Hindu",
    "summary": "This article examines the life and legacy of Shibu Soren, a veteran politician and key figure in the Jharkhand statehood movement. It delves into his role in the formation of the Jharkhand Mukti Morcha (JMM), his fight against tribal exploitation, and his political career. The analysis is framed to help UPSC aspirants understand the critical issues surrounding tribal rights, grassroots movements, and the formation of Indian states.",
    "link": "post-120.html",
    "resource_link": "103.png"
},
    {
    "id": "119",
    "title": "Harassment of Minorities and Erosion of Rights",
    "date": "2025-08-04",
    "subject": "Governance, Social Justice, Constitution",
    "source": "Indian Express",
    "summary": "This article examines the arrest of two nuns and a tribal youth in Chhattisgarh on unsubstantiated charges, which highlights the increasing harassment faced by religious minorities in India. It delves into the breakdown of the rule of law, the violation of constitutional rights, and the misuse of legal processes. The analysis is framed to help UPSC aspirants understand the critical issues surrounding police accountability, the rights of marginalized communities, and threats to India's pluralistic democracy.",
    "link": "post-119.html",
    "resource_link": "102.png"
},
    {
    "id": "118",
    "title": "Redesigning Energy Security in India",
    "date": "2025-08-04",
    "subject": "Economy, Environment, Governance",
    "source": "Indian Express",
    "summary": "This article discusses the need for a new approach to India's energy security, moving beyond fossil fuels to a cleaner, sustainable model. It highlights the regulatory and systemic challenges faced by the renewable energy sector, such as a high compliance burden, infrastructure imbalance, and fragmented oversight. The piece is structured to provide UPSC aspirants with a comprehensive understanding of the issues and offers a set of recommendations for reforming the energy regulatory framework to achieve India's net-zero and 'Energy Atmanirbharta' goals.",
    "link": "post-118.html",
    "resource_link": "101.png"
},
    {
    "id": "117",
    "title": "Malegaon 2008 Bomb Blast Verdict",
    "date": "2025-08-04",
    "subject": "Governance, Judiciary, Internal Security",
    "source": "Indian Express",
    "summary": "This article analyzes the acquittal of all accused in the 2008 Malegaon bomb blast case by a special Mumbai court. It highlights the significant failures of premier investigating agencies like the Maharashtra ATS and NIA in evidence gathering and prosecution. The piece is structured to help UPSC aspirants understand the critical issues of accountability of law enforcement, the role of due process in justice, and the impact of political narratives on sensitive investigations.",
    "link": "post-117.html",
    "resource_link": "100.png"
},
    {
    "id": "116",
    "title": "Maharashtra Government's Policy Rollbacks",
    "date": "2025-08-04",
    "subject": "Governance, Social Justice, Education",
    "source": "Indian Express",
    "summary": "This article provides a comprehensive overview of the Maharashtra government's recent policy rollbacks in the education sector. It details seven key decisions that were reversed, covering topics such as language policy, reservation quotas, uniform standardization, and textbook design. The analysis section is structured to help UPSC aspirants understand the challenges in educational governance, policy implementation, and the constitutional and political implications of these decisions.",
    "link": "post-116.html",
    "resource_link": "99.png"
},
    {
    "id": "115",
    "title": "How to Deal with the Hepatitis A Virus",
    "date": "2025-08-03",
    "subject": "GS Paper II - Health, Governance, Social Justice",
    "source": "Indian Express",
    "summary": "This article provides a comprehensive guide on managing Hepatitis A, a water-borne disease common during the monsoon season. It covers diagnosis, medical management, dietary recommendations, and preventive measures like hygiene and vaccination. The piece is structured to help UPSC aspirants understand the medical and public health challenges associated with the virus, including its symptoms, treatment protocols, and the broader issue of antimicrobial resistance.",
    "link": "post-115.html",
    "resource_link": "98.png"
},
    {
"id": "114",
"title": "Chola Dynasty: A Critical Analysis for UPSC Aspirants",
"date": "2025-08-03",
"subject": "GS Paper I - Indian History, Art & Culture",
"source": "Indian Express",
"summary": "This article provides a critical analysis of the Chola dynasty for UPSC CSE aspirants, covering their periodisation, key rulers, art and architecture, administration, maritime prowess, political legacy, and modern relevance, while also incorporating a critical perspective on their rule.",
"link": "post-114.html",
"resource_link": "97.png"
},
    {
    "id": "113",
    "title": "Discovery of Portuguese-era Arsenal in Goa",
    "date": "2025-08-03",
    "subject": "GS Paper I - Indian History, Art & Culture, GS Paper II - Governance, Heritage, GS Paper III - Science & Technology, Archaeological Discoveries",
    "source": "Indian Express",
    "summary": "This article reports on the discovery of Portuguese-era cannonballs in Old Goa, which has confirmed the location of a major arsenal, mint, and naval dockyard. It delves into the historical significance of this complex, detailing its origins during the Adil Shahi period and its development under Afonso de Albuquerque. The article outlines the multiple functions of the arsenal, from manufacturing cannons and coining money to building warships, and discusses its eventual decline. It also provides insights from the discovery, such as the use of stone cannonballs, and its corroboration of historical accounts from figures like Francois Pyrard de Laval and Frederick Charles Danvers, making it a valuable resource for UPSC aspirants studying colonial history and archaeology.",
    "link": "post-113.html",
    "resource_link": "96.png"
},
    {
    "id": "112",
    "title": "Assam's Eviction Drives and Inter-State Tensions in the North-East",
    "date": "2025-08-03",
    "subject": "GS Paper II - Polity, Governance, Federalism, Internal Security, GS Paper III - Land Reforms, Border Management",
    "source": "Indian Express",
    "summary": "This article examines the Assam government's eviction drives, triggered by a Gauhati High Court order to clear encroached forest and 'satra' lands. It explores the political context behind the drive, which is framed as a fight against 'demographic invasion,' and details the specific statistics on encroachment. The piece highlights the significant concern of neighboring states like Nagaland and Mizoram, which fear a spillover of displaced populations and see the drive as linked to historical border disputes. It also discusses the legal frameworks involved, such as the Forest Rights Act, and the ongoing efforts for resolution, providing a comprehensive analysis for UPSC aspirants on a complex issue of internal security and federal relations.",
    "link": "post-112.html",
    "resource_link": "95.png"
},
    {
    "id": "111",
    "title": "US Tariffs on India and their Impact",
    "date": "2025-08-03",
    "subject": "GS Paper II - International Relations, Governance, Indian Economy, GS Paper III - Indian Economy, Trade & Commerce, Bilateral Relations",
    "source": "The Hindu",
    "summary": "This article details the imposition of a 25% tariff on Indian imports by the US, announced by President Donald Trump. It outlines the reasons cited by the US—India's high trade barriers and its ties with Russia—and analyzes the potential economic impact on India’s GDP and key sectors like textiles, gems, and auto parts. The article also explores the key points of friction in India-US relations, the status of ongoing trade negotiations, and India's diplomatic options. The piece highlights the complex interplay between economic policy, geopolitical strategy, and domestic priorities, providing a comprehensive overview for UPSC aspirants.",
    "link": "post-111.html",
    "resource_link": "94.png"
},
    {
    "id": "110",
    "title": "Wind Energy Development and its Environmental Impact in India",
    "date": "2025-08-03",
    "subject": "GS Paper III - Environment, Conservation, Ecology, Infrastructure",
    "source": "The Hindu",
    "summary": "This article explores the dual challenge of India's wind energy expansion, balancing ambitious climate goals with environmental conservation. It presents a case study from the Thar Desert on avian mortality, highlighting a recent study's findings on the high death rates of raptors, including the Great Indian Bustard. The article also discusses mitigation strategies, the emerging offshore wind sector, and the need for detailed environmental impact assessments and spatial planning to ensure sustainable development. It is a critical analysis of the trade-offs involved in India's renewable energy push.",
    "link": "post-110.html",
    "resource_link": "93.png"
},
    {
    "id": "109",
    "title": "Calls grow to set up permanent National Commission for DNTs",
    "date": "2025-08-03",
    "subject": "GS Paper II - Governance, Welfare of Vulnerable Sections, Social Justice",
    "source": "The Hindu",
    "summary": "This article discusses the growing demand for a permanent national commission for Denotified, Nomadic, and Semi-Nomadic Tribes (DNTs). It highlights the historical context, current challenges in accessing welfare schemes, and the reasons why a dedicated commission is needed. The piece draws parallels with other commissions like the NCSC and NCST, emphasizing that such a body would ensure focused policy, institutional continuity, and social justice for these marginalized communities, aligning with the principle of 'Sabka Saath, Sabka Vikas'.",
    "link": "post-109.html",
    "resource_link": "92.png"
},
    {
    "id": "108",
    "title": "ISRO targets 2027 launch for LVM3 semi-cryogenic stage",
    "date": "2025-08-03",
    "subject": "GS Paper III - Science & Technology, Space Technology",
    "source": "The Hindu",
    "summary": "ISRO is set to launch an upgraded LVM3 rocket with a semi-cryogenic stage by the first quarter of 2027. This upgrade is a major milestone in India's efforts to enhance payload capacity and reduce launch costs. The new semi-cryogenic stage will use a more powerful indigenously developed SE2000 engine, burning refined kerosene (RP-1) and Liquid Oxygen (LOX). This development is crucial for India's heavy-lift space missions, commercial launches, and future programs like Gaganyaan, positioning the country more competitively in the global space market.",
    "link": "post-108.html",
    "resource_link": "91.png"
},
    {
    "id": "107",
    "title": "The Naxals are receding. Now what?",
    "date": "2025-08-03",
    "subject": "GS Paper II - Governance , Internal Security , Welfare Schemes, GS Paper III - Security Challenges in Border & Tribal Areas",
    "source": "The Hindu",
    "summary": "This article discusses the transition from Left Wing Extremism (LWE) to governance in Chhattisgarh's Narayanpur district. It highlights the success of security operations in making the Bastar region more accessible. However, it also outlines significant challenges in service delivery, infrastructure, and digital connectivity. The piece emphasizes the importance of a phased approach—security followed by welfare—and the need for innovative, community-engaged planning to integrate tribal populations into the formal administrative system.",
    "link": "post-107.html",
    "resource_link": "90.png"
},
    {
    "id": "106",
    "title": "Marathi made mandatory, but nothing wrong with learning another Indian language: CM",
    "date": "2025-08-03",
    "subject": "GS Paper II - Governance, Polity, Language Policy, Education",
    "source": "The Hindu",
    "summary": "Maharashtra Chief Minister Devendra Fadnavis has defended the state's policy of making Marathi compulsory in schools while also encouraging the learning of other Indian languages. The statement comes in the wake of political controversy over the temporary inclusion and subsequent withdrawal of Hindi as a third language in the curriculum. The issue highlights a broader conflict between regional linguistic identity and national integration efforts, with opposition parties criticizing the government for allegedly undermining Marathi. The article also touches upon the relevance of the National Education Policy (NEP) 2020 and various constitutional provisions related to language, making it pertinent for UPSC aspirants.",
    "link": "post-106.html",
    "resource_link": "89.png"
},
    {
    "id": "105",
    "title": "Bengal govt. launches ₹8,000-crore drive to address local issues",
    "date": "2025-08-03",
    "subject": "GS Paper II - Governance, Polity, Welfare Schemes",
    "source": "The Hindu",
    "summary": "In a major pre-election push, the West Bengal government, led by the Trinamool Congress (TMC), has launched a new ₹8,000-crore outreach programme called 'Amader Para, Amader Samadhan (APAS)'. The initiative aims to empower local communities to identify and prioritize their own infrastructure needs, such as road repairs and water supply systems. With over ₹10 lakh allocated per polling booth, the scheme integrates existing welfare initiatives like 'Duare Sarkar'. Politically, the move is seen as a counter-narrative to the opposition's efforts to mobilize voters under the Citizenship (Amendment) Act, 2019, and addresses grassroots-level issues ahead of the 2026 Assembly elections.",
    "link": "post-105.html",
    "resource_link": "88.png"
},
    {
    "id": "104",
    "title": "Our Air Defence Systems, Missiles, Drones Showcased Power of Self-Reliant India: Modi",
    "date": "2025-08-03",
    "subject": "Internal Security, Defence, Atmanirbhar Bharat, Counter-Terrorism, Governance, UPSC GS II/III/IV",
    "source": "The Hindu",
    "summary": "PM Narendra Modi, addressing a rally in Sevapuri, Varanasi, invoked Lord Shiva's 'Rudra Roop' and highlighted India's firm counter-terrorism actions like Operation Sindoor. Emphasising self-reliance, he showcased the use of indigenous air defence systems, missiles, and drones. He also announced BrahMos missile manufacturing in Lucknow under the U.P. Defence Industrial Corridor. The address also criticized opposition parties for their alleged sympathies towards Pakistan and underscored India's evolving defence capabilities and strategic independence.",
    "link": "post-104.html",
    "resource_link": "87.png"
},
    {
    "id": "103",
    "title": "SC on Environmental Degradation in Himachal Pradesh",
    "date": "2025-08-02",
    "subject": "Environment, Climate Change, Sustainable Development, Indian Judiciary, Governance",
    "source": "Indian Express",
    "summary": "The Supreme Court of India has issued a stern warning regarding the severe environmental degradation in Himachal Pradesh, linking it to unregulated development and unplanned construction. A bench of Justices J B Pardiwala and R Mahadevan highlighted major issues like frequent landslides, deforestation for hydropower projects, and unchecked tourism. The court noted that these factors have led to water shortages, waste management crises, and significant loss of life and property. The SC refused to interfere with the HP High Court's order but directed the state and central governments to prioritize ecological preservation and implement sustainable policies. The ruling underscores the critical need for inter-state coordination to tackle climate issues in the Himalayan region.",
    "link": "post-103.html",
    "resource_link": "86.png"
},
    {
    "id": "102",
    "title": "SC Refuses Plea to Apply POSH Act to Political Parties",
    "date": "2025-08-02",
    "subject": "Indian Judiciary, Governance, Women Issues, Law, Constitution",
    "source": "Indian Express",
    "summary": "The Supreme Court has refused a plea to include political parties under the POSH Act, 2013, stating that this falls under the policy domain of the legislature. The two-judge bench, led by CJI B R Gavai, advised the petitioner to pursue legislative changes, such as a Private Member's Bill. The plea highlighted the lack of institutional redress for women in political engagement who face systemic harassment, citing studies by UN Women and the Inter-Parliamentary Union. The court's decision emphasizes the principle of separation of powers, underscoring that policy formulation is the role of the legislative branch, not the judiciary.",
    "link": "post-102.html",
    "resource_link": "85.png"
},
    {
    "id": "101",
    "title": "71st National Film Awards (2023)",
    "date": "2025-08-02",
    "subject": "Art & Culture, Current Affairs, Indian Cinema, Awards",
    "source": "Indian Express",
    "summary": "The 71st National Film Awards honored outstanding achievements in Indian cinema for the year 2023. Key winners included '12th Fail' for Best Feature Film and Best Actor (Vikrant Massey), 'Jawan' which earned Shah Rukh Khan his first National Award for Best Actor, and 'The Kerala Story' for Best Director (Sudipto Sen). Rani Mukerji won Best Actress for 'Mrs. Chatterjee Vs Norway.' The awards covered a wide range of categories, highlighting achievements in music, choreography, and technical aspects, reflecting the diversity and quality of Indian filmmaking across different languages and genres.",
    "link": "post-101.html",
    "resource_link": "84.png"
},
    {
    "id": "100",
    "title": "EC publishes draft electoral rolls in Bihar, objections allowed until Sept 1",
    "date": "2025-08-02",
    "subject": "Electoral Reforms, Democratic Institutions, Governance, Polity, GS Paper II",
    "source": "Indian Express",
    "summary": "The Election Commission of India has published the draft electoral rolls for Bihar as part of the Special Intensive Revision (SIR) exercise. This initiative aims to ensure the accuracy of voter data ahead of upcoming elections by allowing citizens to file claims and objections from August 1 to September 1, 2025. Key highlights include the receipt of over 7.24 crore enumeration forms, the identification of 22 lakh deceased voters, 7 lakh duplicate entries, and 36 lakh migrated/untraceable voters. The process involves a structured oversight system with Electoral Registration Officers (EROs) and Assistant EROs (AEROs) across all 38 districts. The initiative is significant for demonstrating the EC's commitment to voter roll integrity, transparency, and citizen participation, and is relevant for UPSC Civil Services Examination topics.",
    "link": "post-100.html",
    "resource_link": "83.png"
},
    {
    "id": "99",
    "title": "Locked Out in Fear - Gurugram's Migrant Crisis and Verification Drive",
    "date": "2025-08-01",
    "subject": "Urbanization, Migrant Labor, Human Rights, Governance, Public Policy, Sociopolitical Issues, Labor Economics",
    "source": "The Hindu",
    "summary": "Gurugram's recent police verification drive, targeting alleged illegal Bangladeshi migrants, has led to a mass exodus of Bengali-speaking workers, including those with valid documents. The indiscriminate nature of the raids, coupled with allegations of police brutality and extortion, has fueled widespread fear among the migrant community. This has resulted in severe labor shortages in key sectors like domestic work and sanitation, disrupting urban services. The situation highlights critical issues of ethnic profiling, human rights violations, and the need for a more transparent and humane approach to verifying migrant status, emphasizing the vulnerabilities of informal workers in rapidly urbanizing cities.",
    "link": "post-99.html",
    "resource_link": "82.png"
},
    {
    "id": "98",
    "title": "Psychological Impact of Infertility on Women in Delhi",
    "date": "2025-08-01",
    "subject": "Women's Health, Mental Health, Infertility, Public Health, Healthcare Policy, Sociology, Reproductive Health",
    "source": "The Hindu",
    "summary": "A study by Delhi University and Lady Hardinge Medical College, commissioned by the National Commission for Women in 2019, found that approximately 77% of women seeking fertility treatment in Delhi suffer from depression, a rate significantly higher than the general population. The study highlights the profound psychological burden of infertility, emphasizing the critical need for integrating mental health support, such as counseling and peer groups, into standard fertility treatment protocols. It also underscores the importance of spousal and family support in mitigating the emotional toll and calls for a holistic public healthcare approach that addresses both the medical and psychological aspects of reproductive health.",
    "link": "post-98.html",
    "resource_link": "81.png"
},
    {
    "id": "97",
    "title": "SC Verdict on Telangana Speaker's Delay in Disqualification Proceedings",
    "date": "2025-08-01",
    "subject": "Anti-Defection Law, Tenth Schedule, Role of Speaker, Judicial Review, Political Defections, Constitution, Governance",
    "source": "The Hindu",
    "summary": "The Supreme Court reprimanded the Telangana Assembly Speaker for an unconstitutional delay in deciding disqualification petitions against 10 BRS MLAs who defected to Congress. The Court directed the Speaker to decide the petitions within three months, emphasizing that such delays undermine the integrity of the Speaker's office and the purpose of the Tenth Schedule (Anti-Defection Law). The ruling reinforces that the Speaker's role, while acting as a tribunal, is not immune from judicial review and must be exercised expeditiously to prevent political opportunism. The decision sets a crucial precedent for Speakers across India to ensure timely resolution of defection cases, thereby strengthening the democratic process and political accountability.",
    "link": "post-97.html",
    "resource_link": "80.png"
},
    {
    "id": "96",
    "title": "India-US Relations and Global Economic Landscape",
    "date": "2025-08-01",
    "subject": "International Relations, Foreign Policy, Trade, India-US Relations, Diplomacy, Geopolitics, UPSC Relevance",
    "source": "The Hindu",
    "summary": "This note analyzes the recent strain in India-US relations under the Trump administration, characterized by President Trump's imposition of 25% tariffs on India and his public criticism of its economy. The conflict is rooted in India's ties with Russia and its significant trade surplus with the US. While India's Commerce Minister counters with a 'bright spot' narrative and a focus on domestic growth, the US is also imposing penalties on India's energy trade with Russia and Iran. A major geopolitical shift is highlighted by the US-Pakistan trade deal, which signals a new era of cooperation and a potential realignment of US foreign policy in the region. This development underscores the need for India to diversify its trade relations and adapt its diplomatic strategy to a highly personalized and transactional global environment.",
    "link": "post-96.html",
    "resource_link": "79.png"
},
    {
    "id": "95",
    "title": "India-US Trade and Foreign Policy under Trump Administration",
    "date": "2025-08-01",
    "subject": "International Relations, Foreign Policy, Trade, India-US Relations, Diplomacy, UPSC Relevance",
    "source": "Indian Express",
    "summary": "Under the Trump administration, India has been hit with a 25% tariff on its goods, a move that followed a perceived strategic miscalculation by the Modi government. While other countries like the EU and Japan negotiated more lenient terms, India's diplomacy was seen as unprepared for Trump's transactional style. The situation was complicated by Trump's public claim of credit for the 'Operation Sindoor' ceasefire between India and Pakistan. The article suggests that Indian foreign policy failed to adapt to the personalized diplomacy of the era and highlights the need for a more flexible yet principled approach to international relations. This development has significant implications for India's trade, foreign policy, and strategic autonomy.",
    "link": "post-95.html",
    "resource_link": "78.png"
},
    {
    "id": "94",
    "title": "Anti-Defection Law & Political Developments in Telangana",
    "date": "2025-08-01",
    "subject": "Polity, Anti-Defection Law, Tenth Schedule, Supreme Court, Indian Politics, UPSC Relevance",
    "source": "Indian Express",
    "summary": "The Supreme Court has directed the Telangana Assembly Speaker to make a decision within three months on disqualification petitions against 10 BRS MLAs who defected to the Congress. The court's ruling sets aside a previous stay by the Telangana High Court and highlights the long-standing debate over the Speaker's role in anti-defection cases. The decision may lead to bypolls, but the current assembly arithmetic suggests the Congress's majority will likely remain stable. This development is significant for understanding the Tenth Schedule, the principle of separation of powers, and the ethical issues of political defections in India.",
    "link": "post-94.html",
    "resource_link": "77.png"
},
    {
    "id": "93",
    "title": "No Legal Category of 'Suspicious Voters' - ECI Clarification",
    "date": "2025-08-01",
    "subject": "Electoral Law, Voter Identity, Governance, Constitutional Provisions, UPSC Relevance",
    "source": "Indian Express",
    "summary": "The Election Commission of India (ECI) has officially clarified that the term 'suspicious voters' has no legal standing under the Representation of the People Act, 1951. This came in response to a query in the Rajya Sabha amidst a Special Intensive Revision of electoral rolls in Bihar, which was prompted by concerns over illegal immigrants. The ECI also confirmed that the official Aadhaar-EPIC linking process has not yet begun, though voluntary collection of Aadhaar for de-duplication has been ongoing since 2022. The clarification reinforces the constitutional principle under Article 326 that voting rights are tied to citizenship and not identity documents like Aadhaar, a position upheld by the Supreme Court.",
    "link": "post-93.html",
    "resource_link": "76.png"
},
    {
    "id": "92",
    "title": "G20 Ceremonial Plantation",
    "date": "2025-08-01",
    "subject": "Environment, International Relations, Governance, Public Accountability, UPSC Relevance",
    "source": "Indian Express",
    "summary": "A controversy arose when a citizen group, 'DelhiTrees', pointed out that an 'African Mahogany' sapling planted at the G20 ceremonial site in Nehru Park was, in fact, a native Jamun tree. Investigations confirmed the original African Mahogany from Nigeria had failed and was replaced for aesthetic reasons. The New Delhi Municipal Council (NDMC), which managed the event with the Ministry of External Affairs (MEA), confirmed that a new African Mahogany has been sourced for replanting. Similar issues occurred with saplings from South Korea and South Africa. This incident highlights challenges in coordinating international ceremonial events, the need for robust contingency planning, and the growing role of public scrutiny and social media in ensuring government accountability and environmental ethics.",
    "link": "post-92.html",
    "resource_link": "75.png"
},
    {
    "id": "91",
    "title": "Bihar Electoral Roll Revision (2025) - Special Intensive Revision (SIR)",
    "date": "2025-08-01",
    "subject": "Polity, Governance, Election Commission, Electoral Reforms, UPSC Relevance",
    "source": "Indian Express",
    "summary": "The Election Commission of India has initiated a Special Intensive Revision (SIR) of electoral rolls in Bihar, ahead of the 2025 Assembly elections. All 7.89 crore electors were required to submit new forms, with 7.23 crore forms received so far. This exercise aims to clean the rolls by removing 65 lakh ineligible names, including 22 lakh deceased and 36 lakh untraceable voters. Concerns have been raised by activists and opposition parties, leading to a Supreme Court challenge over the rejection of Aadhaar and Voter ID as valid proofs. The EC has implemented supportive measures, such as deploying AEROs and using existing state databases (e.g., Vikas Register, Khatiyan) to verify eligibility. The final electoral roll is set to be published on September 30, following a claims and objections period in August.",
    "link": "post-91.html",
    "resource_link": "74.png"
},
    {
    "id": "90",
    "title": "India-US Trade Relations amid Trump's Tariff Announcement (2025)",
    "date": "2025-08-01",
    "subject": "International Relations, Economy, Trade Policy, Geopolitics, UPSC Relevance",
    "source": "Indian Express",
    "summary": "Former US President Donald Trump has announced a 25% tariff on Indian goods and a penalty related to India's ties with Russia, challenging India's core trade assumptions. India has responded by emphasizing its commitment to a 'fair, balanced, and mutually beneficial' deal, stating that 'no deal is better than a bad deal.' This move puts India's tariff advantage over competitors like China at risk and raises concerns about trans-shipment issues and the unpredictability of US policy. Despite these challenges, India remains open to negotiations, offering concessions in sectors like industrial goods and public procurement in exchange for reciprocal benefits. The situation highlights the complex interplay of economic interests and geopolitical alignments, underscoring the need for India to diversify its export markets and assert its strategic autonomy in global trade negotiations. The final resolution may depend on high-level diplomatic talks, possibly before an October 2025 deadline.",
    "link": "post-90.html",
    "resource_link": "73.png"
},
    {
    "id": "89",
    "title": "Impact of Trump's Tariffs on Indian Economy (2025-26)",
    "date": "2025-08-01",
    "subject": "Economy, International Relations, Trade, Monetary Policy, Geopolitics, UPSC Relevance",
    "source": "Indian Express",
    "summary": "Former US President Donald Trump's announcement of a 25% tariff on Indian goods, along with potential 'penalties' due to India's ties with Russia, has raised concerns about India's economic growth. Economic institutions like ANZ, HSBC, and Nomura have revised down their GDP growth forecasts for FY 2025-26, with potential impacts ranging from 20 to 40 basis points. This could push India's growth below 6%. Key Indian exports to the US, such as electronics, gems, and textiles, are expected to be hit, with estimated export losses of up to $33 billion. Despite low inflation, the RBI's ability to provide further monetary stimulus is seen as limited. While India's domestic demand provides a buffer, the tariff shock highlights the need for export market diversification and a recalibrated trade strategy. The geopolitical context of the tariffs underscores how strategic partnerships can have economic repercussions.",
    "link": "post-89.html",
    "resource_link": "72.png"
},
    {
    "id": "88",
    "title": "Boost the Capacity of Legal Aid Systems in India",
    "date": "2025-07-31",
    "subject": "Legal Aid, Justice System, Social Justice, Law, Governance, Human Rights, Budgeting, UPSC Relevance",
    "source": "The Hindu",
    "summary": "India's legal aid system, established by the Legal Services Authorities Act, 1987, aims to provide free legal assistance to 80% of the population. While beneficiaries increased to 15.50 lakh in 2023-24, its capacity is hindered by low funding (less than 1% of the justice budget) and resource disparities across states. NALSA's fund utilization has declined, and budget allocations are restrictive. There's a significant 38% drop in para-legal volunteers due to low honorariums (often below minimum wages) and insufficient deployment despite training. The Legal Aid Defence Counsel (LADC) scheme, a positive step, faces reduced allocation for 2024-25. Key challenges include inconsistent service quality, lack of accountability, and limited resources. Recommendations emphasize increased funding, better training and incentives for volunteers, and improved monitoring to fulfill the constitutional mandate of accessible justice.",
    "link": "post-88.html",
    "resource_link": "71.png"
},
    {
    "id": "87",
    "title": "Police Reforms & Custodial Torture in India",
    "date": "2025-07-31",
    "subject": "Governance, Police Reforms, Fundamental Rights, Ethics, Human Dignity, Criminal Justice System",
    "source": "The Hindu",
    "summary": "The editorial highlights the persistent issue of custodial torture in India, prompted by Ajith Kumar's custodial death in Tamil Nadu (2025). It contrasts the 'Dirty Harry' (coercive, rule-breaking) policing model with the 'Sherlock Holmes' (evidence-driven, lawful) model. Between 2018-2023, there were 687 custodial deaths, with Gujarat (81) and Maharashtra (80) leading. Reasons for torture include lack of training, pressure for quick results, poor infrastructure, societal tolerance, weak accountability, and targeting of vulnerable groups. India lacks a standalone anti-torture law and has not ratified the UN Convention Against Torture, leading to a 'high-risk' ranking in the Global Torture Index (2025). Scientific evidence from experts like Shane O'Mara and examples from the Innocence Project (USA) demonstrate torture's ineffectiveness, often leading to false confessions. Effective, non-coercive methods like the UK's PEACE model are recommended. Key recommendations include ratifying the UN Convention, enacting an anti-torture law, adopting the PEACE model, improving training/infrastructure, and ensuring strict accountability. Custodial torture violates Article 21 (Right to life and dignity) and is a 'stain on the soul of the State'. This topic is relevant for UPSC GS-II (Governance, Police Reforms, Fundamental Rights) and GS-IV (Ethics in Public Administration, Rule of Law, Human Dignity).",
    "link": "post-87.html",
    "resource_link": "70.png"
},
    {
  "id": "86",
  "title": "Human-Wildlife Conflict in Gujarat (Case Study: Amreli District)",
  "date": "2025-07-31",
  "subject": "Environment, Society, Human-Wildlife Conflict, Leopard Attacks, UPSC Relevance",
  "source": "The Hindu",
  "summary": "In Japodar village of Gujarat's Amreli district near Gir National Park, leopard threats have escalated. Farmer Bharatbhai Baraiya, a widower raising five daughters, built an 8x6 ft human cage to protect his children from nocturnal attacks. The 2023 Gujarat wildlife census recorded 2,274 leopards statewide, with 126 in Amreli. Human-wildlife conflict, especially with stealthy leopards, highlights rural vulnerability, ecological pressure, and lack of state intervention. Relevant for UPSC GS I (Society), GS III (Environment), and Essay (coexistence and rural dignity themes).",
  "link": "post-86.html",
  "resource_link": "69.png"
},
    {
    "id": "85",
    "title": "Sabotage in Bagmati Express Train Accident",
    "date": "2025-07-31",
    "subject": "Internal Security, Infrastructure (Railways), Government Policies and Interventions, UPSC Relevance",
    "source": "The Hindu",
    "summary": "A final report by the Commissioner of Railway Safety (CRS) has confirmed sabotage as the cause of the Bagmati Express collision with a freight train at Kavarapettai station (TN) on 11 October 2024. The sabotage involved the deliberate removal of rail fittings and connections at Point No. 51B by miscreants, leading to 13 coaches derailing and 19 passengers injured. In response, the Railway Board has strengthened surveillance, deployed Special Forces, and instructed for threat-based patrolling. Special Intelligence Branch (SIB) is monitoring employees and coordinating with intelligence agencies to address insider threats. Loco Pilot G. Subramani is recommended for an award for applying emergency brakes promptly. The National Investigation Agency (NIA) initially found no evidence, but the CRS report confirmed sabotage after a detailed inspection. This event is relevant for UPSC Prelims (CRS, SIB, RPF, railway engineering terms) and Mains GS Paper III (vulnerability of public infrastructure, intelligence role, institutional response to insider threats).",
    "link": "post-85.html",
    "resource_link": "68.png"
},
    {
    "id": "84",
    "title": "Delhi University's Multiple Entry and Exit Scheme (MEME)",
    "date": "2025-07-31",
    "subject": "Education, Government Policies and Interventions, NEP 2020, Higher Education Reforms",
    "source": "The Hindu",
    "summary": "Delhi University has re-notified the Multiple Entry and Exit Scheme (MEME) under NEP 2020, offering significant flexibility to UG and PG students. UG students can exit after 1, 2, 3, or 4 years, earning a Certificate, Diploma, Bachelor's Degree, or Bachelor's with Honours/Research, requiring 44, 88, 132, and 176 credits respectively. PG students can exit after 1 year (of a 2-year program) with a PG Diploma or complete a Master's in 2 years. Four-year UG holders can get a Master's in 1 year. The scheme allows re-entry to the same college and program, subject to minimum credit requirements. Implemented since 2022, MEME aims to promote flexibility, lifelong learning, student autonomy, and reduce dropout rates by providing interim qualifications, aligning with India's shift towards a credit-based modular education system.",
    "link": "post-84.html",
    "resource_link": "67.png"
},
    {
    "id": "83",
    "title": "UN report's mention of TRF a boost to anti-terror drive",
    "date": "2025-07-31",
    "subject": "International Relations, Internal Security, Terrorism, India's Foreign Policy, UNSC, Cross-border Terrorism",
    "source": "The Hindu",
    "summary": "The United Nations Security Council's 1267 Monitoring Team's mention of The Resistance Front (TRF) in its latest report (July 24, 2025) is a significant diplomatic victory for India against cross-border terrorism. TRF, a suspected proxy of Lashkar-e-Taiba (LeT), was linked to the April 22 Pahalgam attack. The UN report highlights TRF's Pakistan-based operations and potential exploitation of regional tensions. This follows extensive Indian diplomatic efforts and the U.S. designation of TRF as a Foreign Terrorist Organization (FTO) and Specially Designated Global Terrorist (SDGT) on July 17, 2025. The inclusion of TRF in the UN report globalizes India's concerns, sets a precedent for UN acknowledgment of newer terror fronts, and may lead to future UN sanctions. This topic is relevant for UPSC Mains GS Paper II (International Relations, global institutions, India's diplomacy) and GS Paper III (Internal Security, terrorism, international cooperation).",
    "link": "post-83.html",
    "resource_link": "66.png"
},
    {
    "id": "82",
    "title": "U.S. Imposes 25% Tariff and Penalty on Indian Imports",
    "date": "2025-07-31",
    "subject": "International Relations, Trade, Economy, India-USA Relations, Tariffs, Trade Barriers, MSMEs, Diplomacy, UPSC Relevance",
    "source": "The Hindu",
    "summary": "The U.S. President Donald Trump announced a 25% tariff plus an unspecified 'penalty' on Indian imports, effective August 1, 2025. This decision, superseding an earlier 26% tariff threat, cites India's energy and defense purchases from Russia, high tariffs on U.S. goods, and 'strenuous and obnoxious' non-monetary trade barriers. The Indian Ministry of Commerce is studying the implications and vows to protect national interests, particularly those of farmers, entrepreneurs, and MSMEs. This move comes amidst ongoing bilateral trade agreement talks and a failed 'mini-deal' attempt, signaling diplomatic strain and potential economic repercussions for India's export sectors. The background includes Trump's 'Liberation Day Tariffs' and U.S. criticism of India's ties with Russia over the Ukraine conflict. India plans to evaluate impacts, potentially seek WTO redress or bilateral de-escalation, and continue working towards a mutually beneficial trade agreement. This issue is highly relevant for UPSC Mains GS Paper 2 (India-USA Relations, International Trade Policies, Diplomacy) and GS Paper 3 (Effects of Liberalization, Trade Agreements, MSME Sector Challenges).",
    "link": "post-82.html",
    "resource_link": "65.png"
},
    {
    "id": "81",
    "title": "India Launches NISAR Satellite: A Landmark Indo-US Collaboration for Earth Observation",
    "date": "2025-07-31",
    "subject": "NISAR Satellite, ISRO, NASA, Earth Observation, Space Technology, Indo-US Collaboration, Disaster Management, Agriculture, Climate Change, UPSC Relevance: GS Paper III - Science and Technology, Environment and Disaster Management",
    "source": "The Hindu",
    "summary": "India successfully launched the NASA-ISRO Synthetic Aperture Radar (NISAR) satellite from the Satish Dhawan Space Centre. This joint venture between ISRO and NASA is the first of its kind, aiming to provide high-resolution, all-weather, day-and-night data on Earth's surface for five years. NISAR will be crucial for monitoring natural disasters, improving crop output, and understanding environmental changes like ground deformation, ice sheet movement, and vegetation dynamics. The GSLV-F16 rocket precisely injected the 2,392 kg satellite into a sun-synchronous orbit. The mission utilizes a dual-frequency SAR (L-band by NASA, S-band by ISRO) and a 12-meter unfurlable mesh reflector antenna. Key phases include launch, deployment of the antenna (starting 10 days post-launch), and commissioning, followed by the science phase. This launch also marks the first time a GSLV has placed a satellite into a sun-synchronous polar orbit.",
    "link": "post-81.html",
    "resource_link": "64.png"
},
    {
        "id": "80",
        "title": "DRDO Holds Back-to-Back Pralay Missile Test Flights",
        "date": "2025-07-30",
        "subject": "DRDO, Pralay Missile, Missile Technology, Defence, National Security, Make in India, Atmanirbhar Bharat, UPSC Relevance",
        "source": "UPSC CSE Notes",
        "summary": "The DRDO successfully conducted back-to-back test flights of the indigenously developed Pralay quasi-ballistic surface-to-surface missile from Dr. A.P.J. Abdul Kalam Island, off the Odisha coast. These tests validated the missile's maximum and minimum range capabilities with pinpoint accuracy, enhancing India's tactical strike capability and deterrence posture. The Pralay missile, with a range of 150-500 km, is capable of carrying multiple warheads and features advanced navigation and guidance systems. Defence Minister Rajnath Singh hailed the tests as a significant milestone for India's indigenous defence capability, reinforcing the 'Make in India' and 'Atmanirbhar Bharat' initiatives.",
        "link": "The Hindu",
        "resource_link": "63.png"
    },
    {
        "id": "79",
        "title": "No Decision Taken to Update National Population Register (NPR): Centre",
        "date": "2025-07-30",
        "subject": "NPR, Census, NRC, Citizenship, Government Policy, UPSC Relevance",
        "source": "UPSC CSE Notes",
        "summary": "The Union Government has informed the Lok Sabha that no decision has been taken to update the National Population Register (NPR), a clarification that may reduce public apprehension given its link to the NRC. The NPR was last updated in 2015-16, holding data of 119 crore residents. Separately, the Census 2027 is planned in two phases, including houselisting and population enumeration, with caste enumeration also to be included. Both NPR and NRC remain politically sensitive, and the inclusion of caste data in the census could significantly influence future policy-making and social justice agendas.",
        "link": "post-79.html",
        "resource_link": "62.png"
    },
    {
        "id": "78",
        "title": "Manipur Preparing for Special Intensive Revision (SIR)",
        "date": "2025-07-30",
        "subject": "Elections, Governance, Ethnic Conflict, Manipur, Electoral Roll, NRC, EC",
        "source": "The Hindu",
        "summary": "The Election Commission's Special Intensive Revision (SIR) of electoral rolls in Manipur has raised concerns amidst ongoing ethnic tensions and demands for an NRC. Political parties, particularly the MPCC, oppose changing voting addresses of IDPs to relief camps, fearing disruption of peace and legitimization of displacement. The move comes as the conflict between Meitei and Kuki-Zo communities persists, with 'illegal immigration' being a core concern. While EC emphasizes accuracy, the exercise is politically sensitive, highlighting the need for transparency and fairness to maintain public trust in the democratic process.",
        "link": "post-78.html",
        "resource_link": "61.png"
    },
    {
        "id": "77",
        "title": "ICJ Advisory Opinion on Climate Obligations",
        "date": "2025-07-30",
        "subject": "Environment, International Law, Climate Justice, ICJ, UNFCCC, Paris Agreement",
        "source": "The Hindu",
        "summary": "The ICJ's recent advisory opinion on climate obligations offers both positive takeaways and significant shortcomings. It reaffirmed the full climate regime and CBDR-RC principle, acknowledging dynamic development status. However, its reinterpretation of the 1.5°C target lacks legal soundness, and it fails to break new ground on enforcement. Critically, it neglects developmental imperatives of the Global South and treats equity merely as a guiding principle rather than a source of new obligations, potentially limiting its impact on global climate negotiations.",
        "link": "post-77.html",
        "resource_link": "60.png"
    },
    {
        "id": "76",
        "title": "From Glory to Decline",
        "date": "2025-07-30",
        "subject": "Cultural Heritage, Governance, Regional Development, Chola Dynasty",
        "source": "The Hindu",
        "summary": "The Aadi Thiruvathirai Festival at Gangaikonda Cholapuram, attended by PM Modi, highlighted the historical significance of Rajendra Chola I and the UNESCO Great Living Chola Temples. Despite this rich heritage, Ariyalur district remains backward, suffering from a lack of promised rail connectivity, underdeveloped industrial estates, and neglected scientific tourism sites. While the state government has announced initiatives, locals express discontent, demanding sustained policy focus on infrastructure, tourism, and industrial development to truly rejuvenate the region.",
        "link": "post-76.html",
        "resource_link": "59.png"
    },
    {
        "id": "75",
        "title": "Why the Gini Index is wrong about India",
        "date": "2025-07-30",
        "subject": "Economy, Inequality, Gini Index, Social Issues, India",
        "source": "Provided Text",
        "summary": "The Gini Index ranks India as a \"moderately low\" inequality society (25.5), yet on-ground realities contradict this. The index underestimates inequality due to large informal employment, low-income thresholds, and non-reporting of taxable income. India faces significant wealth, gender, digital, and educational disparities, with intersectional issues exacerbating these challenges. The provided Gini Index score fails to reflect the true multi-dimensional nature of inequality in India.",
        "link": "post-75.html",
        "resource_link": "58.png"
    },
    {
        "id": "74",
        "title": "Adopt Formalisation to Power Productivity Growth",
        "date": "2025-07-30",
        "subject": "Economy, Labour, Manufacturing, Formalisation, Productivity, Employment",
        "source": "The Hindu",
        "summary": "India's manufacturing sector is increasingly relying on contract labour, moving towards informalisation. This trend, despite comprehensive labour laws, leads to worker exploitation, wage disparities, and negatively impacts labour productivity due to high turnover and low skill investment. While some high-skill and capital-intensive segments show exceptions, the overall picture is concerning for India's ambition to become a global manufacturing hub. Policy suggestions include incentivizing longer fixed-term contracts and reviving schemes like PMRPY to promote stable, skill-rich employment and ensure data-driven policy monitoring.",
        "link": "post-74.html",
        "resource_link": "57.png"
    },
    {
        "id": "73",
        "title": "Bihar's Dark Side: Girl Child Trafficking",
        "date": "2025-07-30",
        "subject": "Girl Child Trafficking, Human Trafficking, Child Exploitation, Social Issues, Bihar, UPSC CSE",
        "source": "UPSC CSE Notes",
        "summary": "Bihar has emerged as a major hub for girl child trafficking in India, fueled by poverty, lack of regulatory oversight, and societal acceptance. Trafficked girls are forced into orchestras, dance troupes, and the flesh trade, enduring severe abuse. This report highlights key statistics, conditions of trafficked girls, contributing factors to Bihar's vulnerability, and failures in the system. It also outlines the legal framework and proposes a multi-pronged PICKET strategy for prevention, prosecution, rehabilitation, and systemic change.",
        "link": "post-73.html",
        "resource_link": "56.png"
    },
    {
        "id": "72",
        "title": "Interrupted Growth: Industrial Output Faces Climate Headwinds",
        "date": "2025-07-30",
        "subject": "Industrial Output, Climate Disruptions, Economic Reporting",
        "source": "The Hindu",
        "summary": "India's industrial output growth hit a 10-month low in June 2025, primarily due to significant contractions in mining and electricity output caused by erratic monsoon patterns and related disruptions. While official economic data often overlooks climate-related impacts, this editorial from The Hindu highlights the urgent need for India to integrate climate attribution into its economic reporting, citing global best practices and the increasing frequency of extreme weather events. Despite the overall slowdown, sectors like capital goods, intermediate goods, and infrastructure goods showed resilience, indicating the positive impact of government spending. The article emphasizes the importance of data transparency and institutional accountability to build resilient economic systems.",
        "link": "post-72.html",
        "resource_link": "55.png"
    },
    {
        "id": "71",
        "title": "Assam govt. launches eviction drive to clear encroached forest land on Nagaland boundary",
        "date": "2025-07-30",
        "subject": "Environment, Inter-State Relations, Governance",
        "source": "The Hindu",
        "summary": "The Assam government initiated an eviction drive in Rengma Reserve Forest, Golaghat district, targeting 11,000 bighas (~3,600 acres) of encroached forest land along the Assam-Nagaland border. The drive, launched after CM Himanta Biswa Sarma's visit, involved heavy machinery and personnel to demolish structures, with over 20% of the land cleared in Phase I. Most encroachers, primarily migrant Muslims, had already vacated after notices. While CM Sarma emphasized the need to curb encroachment and demographic alteration, the NSCN (Niki Sumi faction) condemned it as a 'land grab' targeting Naga territories. The action highlights issues of forest conservation, inter-state boundary disputes, and the balance between environmental protection and human settlement.",
        "link": "post-71.html",
        "resource_link": "54.png"
    },
    {
        "id": "70",
        "title": "Will step in if 'mass exclusion' found in draft voter rolls: SC",
        "date": "2025-07-30",
        "subject": "Polity & Governance, Electoral Reforms, Judicial Review",
        "source": "The Hindu",
        "summary": "The Supreme Court assured intervention if mass exclusions (allegedly 65 lakh) from Bihar's draft electoral rolls are found to be wrongful. Justices Surya Kant and Joymalya Bagchi stated they would act immediately if individuals marked as dead or shifted are found alive. Petitioners, Kapil Sibal and Prashant Bhushan, raised concerns over lack of transparency and likened the EC's actions to 'citizenship screening.' The Election Commission clarified that the draft roll is based on a summary revision and citizens have until September 1 to file claims before the final list is published on September 30. This case highlights the role of the Election Commission, the importance of free and fair elections, the right to vote, and the Supreme Court's power of judicial review.",
        "link": "post-70.html",
        "resource_link": "53.png"
    },
    {
        "id": "69",
        "title": "SC to begin hearing on Presidential Reference with States' arguments",
        "date": "2025-07-30",
        "subject": "Polity & Governance, Constitutional Law, Centre-State Relations",
        "source": "The Hindu",
        "summary": "The Supreme Court began hearings on a Presidential Reference seeking clarity on the timeline for President and Governors in assenting to State Bills. Tamil Nadu and Kerala challenged its maintainability, arguing it addresses already adjudicated issues, citing the Tamil Nadu Governor Case and Cauvery Water Disputes Tribunal Reference as precedents. Kerala's counsel stated it was an 'appeal in disguise' as settled matters are binding. The Constitution Bench, headed by CJI B.R. Gavai, set deadlines for written submissions and oral arguments from the Union Government and States. The case is relevant for understanding separation of powers, Centre-State relations, and the role of Article 143.",
        "link": "post-69.html",
        "resource_link": "52.png"
    },
    {
        "id": "68",
        "title": "No one asked India to stop Operation Sindoor: Modi",
        "date": "2025-07-30",
        "subject": "International Relations, Internal Security, Indian Polity",
        "source": "The Hindu",
        "summary": "Prime Minister Modi addressed the Lok Sabha on July 30, 2025, regarding Operation Sindoor, India's military response to the Pahalgam terror attack. He vehemently denied claims of international pressure leading to a ceasefire with Pakistan, asserting that India's overwhelming military response, not mediation, was responsible. Modi highlighted Operation Sindoor's success in crippling Pakistani air defenses and stated the operation is 'halted, not ended,' serving as a warning to Pakistan for any future terror attacks. He also criticized the Congress party for questioning India's actions and historic policies, including the Indus Waters Treaty. The statement reinforces India's image as self-reliant in defense and challenges narratives of foreign influence on its military decisions.",
        "link": "post-68.html",
        "resource_link": "51.png"
    },
    {
        "id": "67",
        "title": "A Just Equilibrium - Judicial Review of Executive Discretion",
        "date": "2025-07-29",
        "subject": "Governance, Indian Polity, Constitutional Law",
        "source": "Indian Express",
        "summary": "The Supreme Court's decision in 'The State of Tamil Nadu vs The Governor of Tamil Nadu (2025)' has brought to the forefront critical issues concerning the limits of gubernatorial discretion and the judicial review of sovereign functions, impacting the separation of powers and constitutional equilibrium. The Court held that withholding assent by the Governor for an unreasonable period is unconstitutional, mandating decisions within three months. This has led to a presidential reference seeking an advisory opinion from the Supreme Court, raising questions about judicial intervention in executive discretion and the interplay between Articles 200, 201, 142, and 143. The ongoing debate emphasizes the need for judicial self-restraint to avoid politicization of the judiciary and juridification of politics, ensuring the preservation of institutional boundaries and the principle of checks and balances.",
        "link": "post-67.html",
        "resource_link": "50.png"
    },
    {
        "id": "66",
        "title": "ICJ's Advisory Opinion on Climate Change - A Compass for Global and Indian Climate Action",
        "date": "2025-07-29",
        "subject": "International Relations, Environment & Ecology, Governance, Climate Justice",
        "source": "Indian Express",
        "summary": "On July 23, 2025, the International Court of Justice (ICJ) issued a landmark advisory opinion on states' legal obligations regarding climate change, initiated by Vanuatu. Though not legally binding, this ruling has significant implications, reinforcing the principle of Common but Differentiated Responsibilities (CBDR) and highlighting the need for science-based action. For India, it strengthens its stance on climate equity while also prompting a review of fossil fuel subsidies and regulatory enforcement to balance development with climate responsibilities.",
        "link": "post-66.html",
        "resource_link": "49.png"
    },
    {
        "id": "65",
        "title": "PM Modi's Visit to Maldives - A Diplomatic Reset",
        "date": "2025-07-29",
        "subject": "International Relations, Diplomacy, India's Neighbourhood",
        "source": "Indian Express",
        "summary": "Prime Minister Narendra Modi's visit to the Maldives during its Independence Day celebrations in July 2025 signals a diplomatic reset in Indo-Maldivian ties. After a period of friction caused by the 'India Out' campaign and pro-China policies of Maldivian President Mohamed Muizzu, this visit marked the return to constructive engagement. Strategic interests including maritime security, geostrategic influence, and regional diplomacy are central to India's renewed focus on Maldives.",
        "link": "post-65.html",
        "resource_link": "48.png"
    },
    {
        "id": "64",
        "title": "China's Medog Hydropower Project on Yarlung Tsangpo - Strategic, Ecological & Diplomatic Concerns for India",
        "date": "2025-07-29",
        "subject": "International Relations, Ecology, Internal Security, Water Diplomacy",
        "source": "Indian Express",
        "summary": "China has begun constructing a massive ¥1.2 trillion hydropower project on the Yarlung Tsangpo River in Medog County, Tibet—just 30 km from the Indian border. The project raises major strategic, environmental, and legal concerns for India as the river flows into Arunachal Pradesh as the Siang and becomes the Brahmaputra. India fears downstream ecological damage, water flow disruption, and seismic risks, especially given China's unilateral approach and lack of transparency. India must respond diplomatically and strengthen its domestic water security mechanisms.",
        "link": "post-64.html",
        "resource_link": "47.png"
    },
    {
        "id": "63",
        "title": "India's 1st Private Heavy Water Upgrade Test Facility",
        "date": "2025-07-29",
        "subject": "Science & Technology, Nuclear Energy, Infrastructure Development",
        "source": "Government of India",
        "summary": "India has launched its first private heavy water upgrade testing facility in Palghar, Maharashtra, in collaboration with TEMA India and BARC. This public-private milestone enhances nuclear energy infrastructure, reduces reactor commissioning time, and promotes indigenisation of critical technology. The first batch of equipment has been dispatched to RAPP-8, with future projects planned in Gorakhpur and Kaiga.",
        "link": "post-63.html",
        "resource_link": "46.png"
    },
    {
        "id": "62",
        "title": "National Education Policy (NEP) - Five Years of Transformative Change",
        "date": "2025-07-29",
        "subject": "Education Policy, Governance, Social Justice, Human Capital, Technology",
        "source": "Indian Express",
        "summary": "This document summarizes PM Modi's address on the 5th anniversary of NEP, highlighting its role in holistic development, promotion of research, and its focus on a student-centric approach. It emphasizes education as a tool for self-reliance and national strength, integrating Indian culture with modern technology and global standards. The notes also detail NEP's relevance for UPSC CSE across GS Papers II, III, IV, Essay, and Interviews, and suggest further research areas.",
        "link": "post-62.html",
        "resource_link": "45.png"
    },
    {
        "id": "61",
        "title": "Gavri of the Mewar Bhils - A Ritual of Resistance and Renewal",
        "date": "2025-07-29",
        "subject": "Indian Culture, Social Justice, Tribal Studies, Ethics",
        "source": "Indian Express",
        "summary": "Gavri is a 40-day folk ritual celebrated annually by the Bhil community in the Mewar region of Rajasthan. It involves dance-dramas, songs, and ceremonial performances to honor Gorkhiya Mata (Parvati). Performed by male-only troupes, it subverts caste and class hierarchies, asserts Bhil identity, promotes gender fluidity, and reaffirms tribal ecological ethics. Documented by IAS officer Aditi Mehta and photographed by Padma Shri Sudharak Olwe, Gavri is a significant example of India's tribal pluralism and indigenous resistance, offering a counter-narrative to mainstream social structures.",
        "link": "post-61.html",
        "resource_link": "44.png"
    },
    {
        "id": "60",
        "title": "Stray Dog Menace & Supreme Court Suo Motu Action (July 2025)",
        "date": "2025-07-29",
        "subject": "Social Issues, Governance, Ethics, Law, Animal Welfare",
        "source": "Indian Express",
        "summary": "The Supreme Court of India has taken suo motu cognizance of the escalating stray dog menace, particularly in Delhi and surrounding regions, due to alarming reports of attacks on infants and the elderly and the associated rabies risk. This action highlights the critical balance between public safety and animal rights. The MCD has formed a panel to establish shelter homes, while legal and ethical dilemmas surrounding feeding practices, urban governance, and health infrastructure are being debated. The issue involves Constitutional provisions (Article 21), animal welfare laws (Prevention of Cruelty to Animals Act, 1960), and calls for a multi-pronged strategy encompassing sterilization, vaccination, awareness, and better administrative measures.",
        "link": "post-60.html",
        "resource_link": "43.png"
    },
    {
        "id": "59",
        "title": "Divya Deshmukh - A New Era in Indian Women's Chess",
        "date": "2025-07-29",
        "subject": "Sports, Women Empowerment, Youth, Social Issues",
        "source": "Indian Express",
        "summary": "Divya Deshmukh, 19, became India's 4th Woman Grandmaster (GM) and 88th overall GM by winning the FIDE Women's World Cup in Georgia (2025), defeating Koneru Humpy in the final. This achievement is significant as she bypassed the usual GM norm requirements due to FIDE regulations for World Cup winners, marking a generational shift and highlighting India's growing dominance in women's chess. It boosts women's sports and signifies the depth of Indian chess talent.",
        "link": "post-59.html",
        "resource_link": "42.png"
    },
    {
        "id": "58",
        "title": "Supreme Court & Judicial Accountability - Cash Row Case",
        "date": "2025-07-29",
        "subject": "Indian Polity, Judiciary, Constitutional Law, Ethics",
        "source": "Indian Express",
        "summary": "Justice Yashwant Varma of the Allahabad High Court challenged an in-house inquiry by the SC into allegations of burnt currency found at his residence. The case raises critical questions about the legality of the in-house procedure versus the constitutional parliamentary removal process for judges (Articles 124 & 218, Judges (Inquiry) Act, 1968). The SC heard arguments on the extra-constitutional nature of the inquiry and concerns over media leaks, emphasizing the proper channel for judicial removal and the timing of the challenge.",
        "link": "post-58.html",
        "resource_link": "41.png"
    },
    {
        "id": "57",
        "title": "Supreme Court on Electoral Roll Revision - July 2025",
        "date": "2025-07-29",
        "subject": "Indian Polity, Electoral Reforms, Judiciary, Governance",
        "source": "Indian Express",
        "summary": "The Supreme Court declined to stay the publication of the draft electoral roll in Bihar, reiterating its earlier directive for the Election Commission to consider Aadhaar, EPIC, and Ration Cards for inclusion. The court emphasized the prima facie credibility of Aadhaar and EPIC, warning against en masse exclusion while allowing for case-by-case tackling of forgery. It clarified that the draft roll allows for public objections and reserved its power to intervene if unconstitutionality is proven, highlighting its role in safeguarding democratic processes.",
        "link": "post-57.html",
        "resource_link": "40.png"
    },
    {
        "id": "56",
        "title": "Glacial Lake Outburst Floods (GLOFs): India's Preparedness and Challenges",
        "date": "2025-07-28",
        "subject": "Disaster Management, Climate Change, Environment, International Relations",
        "source": "The Hindu",
        "summary": "India faces increasing GLOF risks in the Himalayas due to climate change, with recent events like the Sikkim GLOF highlighting vulnerabilities. The nation is implementing a five-pronged strategy involving hazard assessment, EWS, and community engagement. However, challenges include accessibility, sparse monitoring, and trans-boundary data-sharing issues, necessitating greater regional cooperation and technological advancements.",
        "link": "post-56.html",
        "resource_link": "39.png"
    },
    {
        "id": "55",
        "title": "Understanding Russia's Taliban Gauntlet",
        "date": "2025-07-28",
        "subject": "International Relations, Security, Geopolitics, Ethics",
        "source": "The Hindu",
        "summary": "Russia officially recognized the Islamic Emirate of Afghanistan on July 3, 2025, marking a significant policy shift after two decades of antagonism. This pragmatic move is driven by counterterrorism efforts against IS-K and hopes for regional trade, despite ongoing security concerns and a questionable Taliban anti-IS-K record. It sets a precedent for China and Central Asian states, while India maintains engagement without formal recognition.",
        "link": "post-55.html",
        "resource_link": "38.png"
    },
    {
        "id": "54",
        "title": "Clearing the Air on 'Citizenship' in Bihar Poll Roll Revision",
        "date": "2025-07-28",
        "subject": "Citizenship, Electoral Reforms, Election Commission, Constitutional Law, Governance",
        "source": "The Hindu",
        "summary": "This article clarifies that only Indian citizens can vote or be elected, as per constitutional and statutory law. It emphasizes the ECI's duty to verify citizenship for electoral rolls, dismissing Aadhaar as proof of citizenship.",
        "link": "post-54.html",
        "resource_link": "37.png"
    },
    {
        "id": "53",
        "title": "Criminalising Adolescent Sex & POCSO Act Reforms",
        "date": "2025-07-28",
        "subject": "Law, Governance, Social Justice, Child Rights, Judicial Reforms",
        "source": "The Hindu",
        "summary": "This note discusses the criminalization of consensual adolescent sex under POCSO, judicial interventions, and Law Commission recommendations. It highlights concerns with the current law and suggests reforms for child protection.",
        "link": "post-53.html",
        "resource_link": "36.png"
    },
    {
        "id": "52",
        "title": "Activists demand Devadasi survey in Karnataka without condition of age limit",
        "date": "2025-07-28",
        "subject": "Social Justice, Governance, Women's Empowerment, Human Rights",
        "source": "The Hindu",
        "summary": "Activists and NLSIU are urging the Karnataka government to conduct the third Devadasi survey without an age limit to ensure comprehensive identification, as previous surveys excluded many women and missed a significant population, despite the practice being banned since 1982.",
        "link": "post-52.html",
        "resource_link": "35.png"
    },
    {
        "id": "51",
        "title": "Rajasthan govt. to demolish unsafe school buildings",
        "date": "2025-07-28",
        "subject": "Governance, Disaster Management, Infrastructure Development, Public Administration, Education",
        "source": "The Hindu",
        "summary": "Following a school collapse, the Rajasthan government will demolish unsafe school buildings, use container classrooms, and launch a statewide survey. A ₹150 crore fund, AI-GIS integration for monitoring, and strict quality control, including private schools and MP/MLA contributions, aim to ensure structural safety and accountability.",
        "link": "post-51.html",
        "resource_link": "34.png"
    },
    {
        "id": "50",
        "title": "Notes for UPSC CSE Aspirant: Delhi Govt.'s Move to Amend Labour Laws",
        "date": "2025-07-28",
        "subject": "Governance, Social Justice, Economy, Industrial Policy, Polity",
        "source": "The Hindu",
        "summary": "Delhi government's proposed labour law amendments (e.g., raising applicability thresholds) prioritize 'Ease of Doing Business' but critics argue they strip millions of workers of rights. This highlights a critical policy conflict, impacting informal sector workers and raising questions about social protection versus economic flexibility.",
        "link": "post-50.html",
        "resource_link": "33.png"
    },
    {
        "id": "49",
        "title": "The Return of the Native",
        "date": "2025-07-28",
        "subject": "Sociology, Ethics, Governance, Social Justice, Tribal Issues",
        "source": "The Hindu",
        "summary": "This article highlights the conflict between traditional tribal justice (Chadotaru) and formal law in Gujarat and Rajasthan, detailing the forced exile and hardship faced by the Kodarvi tribe. It underscores the vital role of state and community collaboration in resolving social exclusion.",
        "link": "post-49.html",
        "resource_link": "32.png"
    },
    {
        "id": "48",
        "title": "'Logistics and Warehousing Policy to be launched soon'",
        "date": "2025-07-28",
        "subject": "Urban Governance, Infrastructure, Sustainable Development, Economy, Technology",
        "source": "The Hindu",
        "summary": "Delhi's upcoming Logistics and Warehousing Policy 2025 aims to ease traffic, curb pollution through green corridors, and boost ease of doing business via dedicated hubs and technology, positioning Delhi as a leader in sustainable urban freight management.",
        "link": "post-48.html",
        "resource_link": "31.png"
    },
    {
        "id": "47",
        "title": "Maharashtra halts Ladki Bahin aid for 26.34 lakh beneficiaries",
        "date": "2025-07-28",
        "subject": "Governance, Social Justice, Women Empowerment, Electoral Politics, Public Administration",
        "source": "The Hindu",
        "summary": "Maharashtra suspended Ladki Bahin scheme payments for 26.34 lakh beneficiaries pending verification to curb fraudulent claims. While 2.25 crore continue, this highlights the need for transparent governance, robust fraud detection in welfare schemes, and the intersection of politics with social welfare.",
        "link": "post-47.html",
        "resource_link": "30.png"
    },
    {
        "id": "46",
        "title": "Chola dynasty's legacy provides road map for modern India: PM",
        "date": "2025-07-28",
        "subject": "History, Governance, National Security, International Relations",
        "source": "The Hindu",
        "summary": "PM Modi highlighted the Chola dynasty's military, administrative, and economic brilliance as a roadmap for modern India's development, emphasizing naval strength, local governance, and safeguarding core values, while commemorating Chola rulers' contributions to national pride and security.",
        "link": "post-46.html",
        "resource_link": "29.png"
    },
    {
        "id": "45",
        "title": "Eight killed in stampede at temple in Haridwar",
        "date": "2025-07-28",
        "subject": "Disaster Management, Governance, Social Issues",
        "source": "The Hindu",
        "summary": "Eight pilgrims died and 30 injured in a stampede at Mansa Devi temple, Haridwar, triggered by a false rumor of an electric line snap. The incident exposed critical gaps in crowd control and emergency planning at religious sites, highlighting the need for improved disaster preparedness and regulatory frameworks to ensure public safety in high-traffic religious destinations.",
        "link": "post-45.html",
        "resource_link": "28.png"
    },
    {
        "id": "44",
        "title": "Ocean Heatwaves Reach Extreme Levels, Indicate Tipping Point",
        "date": "2025-07-27",
        "subject": "Environment & Ecology, Economy, Disaster Management, Geography, International Relations",
        "source": "The Economic Times",
        "summary": "China's ambitious dam construction on the upper reaches of the Brahmaputra (Yarlung Tsangpo in Tibet) and its implications for downstream riparian countries, particularly India and Bangladesh.",
        "link": "post-44.html",
        "resource_link": "27.png"
    },
    {
        "id": "43",
        "title": "Ocean Heatwaves Reach Extreme Levels, Indicate Tipping Point",
        "date": "2025-07-27",
        "subject": "Environment, Climate Change",
        "source": "The Hindu",
        "summary": "2023 saw extreme marine heatwaves across 96% of oceans, with 53.6 billion degrees C-days thermal stress, suggesting Earth's tipping point.",
        "link": "post-43.html",
        "resource_link": "26.png"
    },
    {
        "id": "42",
        "title": "Android Phones Provide Early Earthquake Warnings Globally",
        "date": "2025-07-27",
        "subject": "Science & Technology, Disaster Management",
        "source": "The Hindu",
        "summary": "Android phones use accelerometers for earthquake alerts in 98 countries, detecting P-waves before destructive S-waves, significantly improving disaster preparedness globally.",
        "link": "post-42.html",
        "resource_link": "25.png"
    },
    {
        "id": "41",
        "title": "Altermagnet's charge carriers change in different directions",
        "date": "2025-07-27",
        "subject": "Science & Technology",
        "source": "The Hindu",
        "summary": "Indian researchers discovered chromium-antimony (CrSb) as the first altermagnet with direction-dependent charge carriers (electrons/holes), promising for spintronics and electronics.",
        "link": "post-41.html",
        "resource_link": "24.png"
    },
    {
        "id": "40",
        "title": "U.K.-India FTA May Favor Patent Owners, Affecting Drug Access",
        "date": "2025-07-27",
        "subject": "Economy, Health, International Relations",
        "source": "The Hindu",
        "summary": "UK-India FTA patent clauses may favor owners, impacting affordable medicine access, concerns over evergreening, transparency, despite export benefits.",
        "link": "post-40.html",
        "resource_link": "23.png"
    },
    {
        "id": "39",
        "title": "Two half-dose combination of drugs right for BP control in Indians: study",
        "date": "2025-07-27",
        "subject": "Health, Science & Technology",
        "source": "The Hindu",
        "summary": "Indian study in Nature Medicine finds dual hypertension drug combos effective, safe, recommends half-doses, avoiding polypharmacy for better compliance.",
        "link": "post-39.html",
        "resource_link": "22.png"
    },
    {
        "id": "38",
        "title": "India's Advisory on Border Clashes in Cambodia - Key Points for UPSC CSE",
        "date": "2025-07-27",
        "subject": "International Relations, Geopolitics",
        "source": "The Hindu",
        "summary": "India advises citizens to avoid Cambodia-Thailand border clashes (32 casualties), emphasizing geopolitical, humanitarian, and diplomatic implications for UPSC CSE.",
        "link": "post-38.html",
        "resource_link": "21.png"
    },
    {
        "id": "37",
        "title": "Ashok Gajapathi Raju Sworn In as Goa Governor",
        "date": "2025-07-27",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "Former Union Minister Ashok Gajapathi Raju sworn in as Goa's 22nd Governor, replacing P.S. Sreedharan Pillai.",
        "link": "post-37.html",
        "resource_link": "20.png"
    },
    {
        "id": "36",
        "title": "Amit Shah: India's Rising Stature Brings Security Challenges",
        "date": "2025-07-27",
        "subject": "National Security, Governance",
        "source": "The Hindu",
        "summary": "Amit Shah warns rising India faces dynamic security challenges, calls for coordinated Central-State action, focus on narcotics, LWE.",
        "link": "post-36.html",
        "resource_link": "19.png"
    },
    {
        "id": "35",
        "title": "Operation Sindoor: India's Decisive Message to Pakistan",
        "date": "2025-07-27",
        "subject": "National Security, Defence",
        "source": "The Hindu",
        "summary": "Army Chief states 'Operation Sindoor' was decisive response to Pakistan, eliminating 9 terrorists with zero collateral damage, reinforcing India's sovereignty.",
        "link": "post-35.html",
        "resource_link": "18.png"
    },
    {
        "id": "34",
        "title": "Cast-off capital",
        "date": "2025-07-27",
        "subject": "Environment, Economy",
        "source": "The Hindu",
        "summary": "Asia's largest textile recycling hub, Panipat, faces severe water and air pollution from illegal bleaching units, impacting health and environment, prompting NGT action.",
        "link": "post-34.html",
        "resource_link": "17.png"
    },
    {
        "id": "33",
        "title": "Modi: Central Projects Drive 'Viksit Tamil Nadu'",
        "date": "2025-07-27",
        "subject": "Economy, Governance, Infrastructure",
        "source": "The Hindu",
        "summary": "PM Modi states over ₹3 lakh crore central projects in Tamil Nadu aim for 'Viksit Tamil Nadu', boosting infrastructure, trade, and employment.",
        "link": "post-33.html",
        "resource_link": "15.png"
    },
    {
        "id": "32",
        "title": "Modi, Muizzu Reset India-Maldives Ties",
        "date": "2025-07-27",
        "subject": "International Relations",
        "source": "The Hindu",
        "summary": "PM Modi's Maldives visit signals major bilateral ties reset, overcoming past strains with focus on deepening cooperation and shared interests.",
        "link": "post-32.html",
        "resource_link": "14.png"
    },
    {
        "id": "31",
        "title": "Bengal Governor Returns Aparajita Bill Over Centre's Objections",
        "date": "2025-07-26",
        "subject": "Polity & Governance",
        "source": "Indian Express",
        "summary": "Bengal Governor returned Aparajita Bill to state, citing Centre's objections to proposed BNS changes on rape penalties for being disproportionate and harsh.",
        "link": "post-31.html",
        "resource_link": "https://indianexpress.com/article/cities/kolkata/bengal-centre-raises-concern-over-death-penalty-clause-in-aparajita-bill-governor-sends-it-back-to-state-govt-10150139/"
    },
    {
        "id": "30",
        "title": "WHO's 'Global Specs 2030' for Affordable Eyecare",
        "date": "2025-07-26",
        "subject": "Health & Social Issues",
        "source": "Indian Express",
        "summary": "WHO launches 'Global Specs 2030' to ensure affordable eyecare for 800M+ people globally, focusing on youth as change catalysts for vision health.",
        "link": "post-30.html",
        "resource_link": "https://indianexpress.com/article/lifestyle/health/who-initiative-to-ensure-affordable-eyecare-services-for-all-by-2030-10150269/"
    },
    {
        "id": "29",
        "title": "RBI Governor on Fed, Inflation, and Economy",
        "date": "2025-07-26",
        "subject": "Economy",
        "source": "Indian Express",
        "summary": "RBI Governor praised US Fed's independence, affirmed continuous inflation war despite recent moderation, and discussed monetary policy, credit growth, and trade deals.",
        "link": "post-29.html",
        "resource_link": "https://indianexpress.com/article/business/rbi-governor-sanjay-malhotra-us-fed-chair-doing-good-job-central-bank-independence-important-10150268/#:~:text=AMID%20THE%20ongoing%20feud%20between,doing%20a%20very%20good%20job."
    },
    {
        "id": "28",
        "title": "Europe, Iran Meet Amidst Nuclear Deadlock & Sanctions Threat",
        "date": "2025-07-26",
        "subject": "International Relations",
        "source": "Indian Express",
        "summary": "Europe and Iran meet in Istanbul to discuss nuclear deadlock and potential sanctions snapback, amidst Israeli-US strikes and Iran's uranium enrichment.",
        "link": "post-28.html",
        "resource_link": "https://indianexpress.com/article/world/iran-europe-nuclear-talks-istanbul-sanctions-deadlock-10148869/"
    },
    {
        "id": "27",
        "title": "France to Recognise Palestinian State, Draws Fire",
        "date": "2025-07-26",
        "subject": "International Relations",
        "source": "The Hindu",
        "summary": "France plans to recognise a Palestinian state at UNGA, drawing strong condemnation from Israel and the US, who view it as rewarding terror.",
        "link": "post-27.html",
        "resource_link": "https://www.thehindu.com/news/international/french-plan-to-recognise-palestinian-state-draws-fire-from-israel-us/article68450500.ece"
    },
    {
        "id": "26",
        "title": "Consensual Sex (16-18) Not Abuse: SC Amicus Curiae",
        "date": "2025-07-26",
        "subject": "Polity & Governance, Social Issues",
        "source": "The Hindu",
        "summary": "SC amicus curiae argues consensual sex between 16-18 year olds shouldn't be criminalized under POCSO, advocating a 'close-in-age exception' to protect adolescent relationships.",
        "link": "post-26.html",
        "resource_link": "https://www.thehindu.com/news/national/consensual-sex-between-adolescents-aged-16-to-18-must-not-be-treated-as-abuse/article68450123.ece"
    },
    {
        "id": "25",
        "title": "Draft Data Protection Rules Receive Over 6,900 Inputs",
        "date": "2025-07-26",
        "subject": "Polity & Governance, Science & Technology",
        "source": "Ministry of Electronics and Information Technology",
        "summary": "Draft Data Protection Rules received 6,915 inputs. Ministry confirmed consultations, emphasizing penalties for non-compliance, showing broad stakeholder engagement.",
        "link": "post-25.html",
        "resource_link": "https://www.thehindu.com/news/national/received-over-6900-inputs-on-draft-data-rules-ministry/article68450000.ece"
    },
    {
        "id": "24",
        "title": "66 Lakh Voters May Be Excluded from Draft Roll",
        "date": "2025-07-26",
        "subject": "Polity & Governance",
        "source": "Election Commission Data",
        "summary": "EC data indicates 66 lakh voters may miss draft electoral roll due to deceased, duplicate, or untraceable entries, sparking controversy and legal challenges.",
        "link": "post-24.html",
        "resource_link": "https://www.thehindu.com/news/national/66-lakh-voters-may-be-left-out-of-draft-roll-ec-data/article68449666.ece"
    },
    {
        "id": "23",
        "title": "Meghalaya HC Seeks Action Over Missing Coal",
        "date": "2025-07-26",
        "subject": "Polity & Governance, Environment",
        "source": "The Hindu",
        "summary": "Meghalaya High Court demands government action after 3,950 MT of illegally mined coal vanished from depots, citing accountability and illegal transportation concerns.",
        "link": "post-23.html",
        "resource_link": "https://www.thehindu.com/news/national/meghalaya-hc-seeks-govt-action-after-coal-vanishes-from-depots/article68449555.ece"
    },
    {
        "id": "22",
        "title": "Bihar's Debt Cycle: Microfinance & Harsh Recovery",
        "date": "2025-07-26",
        "subject": "Social Issues & Economy",
        "source": "The Hindu",
        "summary": "Bihar's poor face a severe debt trap from microfinance and informal loans, exacerbated by aggressive recovery agents, despite RBI guidelines, highlighting systemic flaws.",
        "link": "post-22.html",
        "resource_link": "https://www.thehindu.com/news/national/other-states/in-bihar-a-matter-of-life-and-debt/article68449000.ece"
    },
    {
        "id": "21",
        "title": "India-UK Trade Deal: A Template for Future Pacts",
        "date": "2025-07-26",
        "subject": "Economy & International Relations",
        "source": "The Hindu",
        "summary": "India-UK trade deal, a 'give and take' example, offers duty-free access for most goods. It sets a template for future EU and US agreements.",
        "link": "post-21.html",
        "resource_link": "https://www.thehindu.com/opinion/editorial/give-and-take-the-india-uk-trade-deal-may-set-the-template-for-the-eu-and-us-deals/article68448888.ece"
    },
    {
        "id": "20",
        "title": "AI Chip Developers Counter Allegations, Cite Centre's Support",
        "date": "2025-07-26",
        "subject": "Science & Technology",
        "source": "The Hindu",
        "summary": "Digital University Kerala's AI chip developers defend their invention as academic research, highlighting Centre's 'Chip to Startup' program support amidst transparency allegations.",
        "link": "post-20.html",
        "resource_link": "https://www.thehindu.com/sci-tech/technology/ai-chip-developers-hit-back-at-allegations-cite-support-from-centre/article12345678903.ece"
    },
    {
        "id": "19",
        "title": "185 Pak. Refugees Get Indian Citizenship Under CAA",
        "date": "2025-07-26",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "185 Pakistani refugees received Indian citizenship under CAA in Gujarat, ending years of uncertainty and granting them dignity, safety, and equal opportunities.",
        "link": "post-19.html",
        "resource_link": "https://www.thehindu.com/news/national/185-pak-refugees-get-indian-citizenship-under-caa/article12345678902.ece"
    },
    {
        "id": "18",
        "title": "Meghalaya Considers Mandatory Pre-Marriage HIV/AIDS Test",
        "date": "2025-07-25",
        "subject": "Social Issues & Health",
        "source": "The Hindu",
        "summary": "Meghalaya is considering mandatory pre-marriage HIV/AIDS testing due to alarming rising cases, particularly in East Khasi Hills. This aims to formulate a comprehensive state policy on HIV/AIDS.",
        "link": "post-18.html",
        "resource_link": "https://www.thehindu.com/news/national/meghalaya-pre-marriage-hivaids-test-mandatory/article12345678901.ece"
    },
    {
        "id": "17",
        "title": "Lok Sabha to take up motion to remove HC judge",
        "date": "2025-07-25",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "Lok Sabha will consider a bipartisan motion to remove Allahabad HC Justice Yashwant Varma due to a cash recovery controversy. The process follows the Judges (Inquiry) Act, involving an inquiry committee.",
        "link": "post-17.html",
        "resource_link": "https://www.thehindu.com/news/national/ls-to-take-up-motion-to-remove-hc-judge/article1234567890.ece"
    },
    {
        "id": "16",
        "title": "India-UK Trade Pact: A Template for Future Deals",
        "date": "2025-07-25",
        "subject": "Economy & International Relations",
        "source": "Indian Express",
        "summary": "India and the UK signed a comprehensive trade deal to double bilateral trade. It lowers India's tariffs significantly while giving Indian exports duty-free access to the UK, aiming to deepen economic ties.",
        "link": "post-16.html",
        "resource_link": "https://indianexpress.com/article/opinion/editorials/india-uk-trade-pact-a-template-for-deals-with-america-and-europ-10147850/"
    },
    {
        "id": "15",
        "title": "Why a Strong Rouble is a Double-Edged Sword for Russia",
        "date": "2025-07-25",
        "subject": "Economy & International Relations",
        "source": "Reuters",
        "summary": "The Russian rouble's rise, driven by tight policy and peace hopes, is a double-edged sword. While signaling economic strength, it cuts budget revenues and hurts exporters, posing challenges despite the central bank's inflation fight.",
        "link": "post-15.html",
        "resource_link": "https://www.reuters.com/markets/currencies/why-strong-rouble-is-double-edged-sword-russia-2025-07-25/"
    },
    {
        "id": "14",
        "title": "Unpacking National Sports Governance Bill",
        "date": "2025-07-25",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "Detailed analysis of the National Sports Governance Bill, including the proposed National Sports Board and Tribunal, its need, implications for judicial intervention, and impact on bodies like BCCI.",
        "link": "post-14.html",
        "resource_link": "https://www.thehindu.com/sport/national-sports-governance-bill-now-in-ls/article123456789.ece"
    },
    {
        "id": "13",
        "title": "Lorem",
        "date": "2025-07-25",
        "subject": "Economy & Technology",
        "source": "The Economic Times",
        "summary": "India is making significant strides in its semiconductor mission, aiming to establish a robust ecosystem for chip manufacturing and design. This initiative is crucial for technological self-reliance and economic growth, attracting major global players.",
        "link": "post-13.html",
        "resource_link": "https://economictimes.indiatimes.com/news/economy/policy/india-semiconductor-mission-a-strategic-push/articleshow/100000001.cms"
    },
    {
        "id": "12",
        "title": "Sports Development: India's Preparations for Global Events",
        "date": "2025-07-14",
        "subject": "Sports & Youth Affairs",
        "source": "Sports Authority of India (SAI)",
        "summary": "India's preparations for upcoming major global sporting events are in full swing. This post highlights the government's initiatives to promote sports, identify talent, and provide world-class training facilities.",
        "link": "post-12.html",
        "resource_link": "https://sportsauthorityofindia.nic.in/schemes-programmes"
    },
    {
        "id": "11",
        "title": "Wildlife Conservation: Project Tiger's New Phase",
        "date": "2025-07-15",
        "subject": "Environment & Biodiversity",
        "source": "Ministry of Environment, Forest and Climate Change",
        "summary": "Project Tiger enters a new phase with enhanced conservation strategies and expanded protected areas. The initiative aims to further boost tiger populations and preserve critical habitats across India.",
        "link": "post-11.html",
        "resource_link": "https://moef.gov.in/project-tiger/"
    },
    {
        "id": "10",
        "title": "Judicial Reforms: Expediting Justice Delivery",
        "date": "2025-07-16",
        "subject": "Polity & Governance",
        "source": "The Hindu",
        "summary": "Discussions on ongoing judicial reforms aimed at reducing pendency and expediting justice delivery in India. Key areas include digitalization of courts, alternative dispute resolution mechanisms, and judicial appointments.",
        "link": "post-10.html",
        "resource_link": "https://www.thehindu.com/news/national/judicial-reforms/article12345678.ece"
    },
    {
        "id": "9",
        "title": "Urban Development: Smart Cities Mission Update",
        "date": "2025-07-17",
        "subject": "Urban Planning & Infrastructure",
        "source": "Ministry of Housing and Urban Affairs",
        "summary": "An update on the Smart Cities Mission, showcasing successful projects and ongoing initiatives to transform urban landscapes. The focus is on sustainable development, citizen-centric services, and technological integration.",
        "link": "post-9.html",
        "resource_link": "https://smartcities.gov.in/content/"
    },
    {
        "id": "8",
        "title": "Healthcare Reforms: Focus on Ayushman Bharat",
        "date": "2025-07-18",
        "subject": "Social Issues & Health",
        "source": "Ministry of Health & Family Welfare",
        "summary": "Recent reforms in India's healthcare sector emphasize strengthening the Ayushman Bharat scheme. The aim is to expand coverage, improve access to quality healthcare, and enhance public health infrastructure.",
        "link": "post-8.html",
        "resource_link": "https://pmjay.gov.in/"
    },
    {
        "id": "7",
        "title": "Digital Public Infrastructure (DPI) in India: A Global Model",
        "date": "2025-07-19",
        "subject": "Governance & Technology",
        "source": "NITI Aayog",
        "summary": "India's Digital Public Infrastructure (DPI) model, encompassing Aadhaar, UPI, and DigiLocker, is gaining international recognition. This article explores how DPI is transforming governance and service delivery.",
        "link": "post-7.html",
        "resource_link": "https://www.niti.gov.in/digital-public-infrastructure"
    },
    {
        "id": "6",
        "title": "Renewable Energy Targets: Progress and Challenges",
        "date": "2025-07-20",
        "subject": "Environment & Energy",
        "source": "Ministry of New and Renewable Energy",
        "summary": "An assessment of India's progress towards its ambitious renewable energy targets. The report highlights achievements in solar and wind power, alongside the challenges in grid integration and energy storage.",
        "link": "post-6.html",
        "resource_link": "https://mnre.gov.in/achievements"
    },
    {
        "id": "5",
        "title": "India's Foreign Policy: Engaging with the Global South",
        "date": "2025-07-21",
        "subject": "International Relations",
        "source": "Ministry of External Affairs, GoI",
        "summary": "India's proactive engagement with countries of the Global South is a cornerstone of its foreign policy. Discussions focus on strengthening economic ties, fostering multilateral cooperation, and addressing shared challenges.",
        "link": "post-5.html",
        "resource_link": "https://www.mea.gov.in/foreign-policy.htm"
    },
    {
        "id": "4",
        "title": "Space Exploration: ISRO's Upcoming Missions",
        "date": "2025-07-22",
        "subject": "Science & Technology",
        "source": "ISRO Official Website",
        "summary": "The Indian Space Research Organisation (ISRO) unveils its ambitious roadmap for upcoming space missions, including lunar probes, solar observations, and advancements in satellite technology, reinforcing India's position in global space exploration.",
        "link": "post-4.html",
        "resource_link": "https://www.isro.gov.in/upcoming-missions"
    },
    {
        "id": "3",
        "title": "New Education Policy (NEP) 2020: Implementation Progress",
        "date": "2025-07-23",
        "subject": "Social Issues & Education",
        "source": "Ministry of Education, GoI",
        "summary": "An overview of the progress and challenges in implementing the National Education Policy (NEP) 2020. Focus areas include curriculum reforms, digital education integration, and skill development initiatives.",
        "link": "post-3.html",
        "resource_link": "https://www.education.gov.in/nep"
    },
    {
        "id": "2",
        "title": "Monsoon Forecast 2025: Implications for Agriculture",
        "date": "2025-07-24",
        "subject": "Geography & Agriculture",
        "source": "India Meteorological Department (IMD)",
        "summary": "The latest monsoon forecast for 2025 indicates a normal to above-normal rainfall, which is a positive sign for the agricultural sector. Experts discuss the potential impact on crop yields and food security across various regions.",
        "link": "post-2.html",
        "resource_link": "https://mausam.imd.gov.in/imd_latest/contents/press_release_details.php?id=12345"
    },
    {
        "id": "1",
        "title": "India's Semiconductor Mission: A Strategic Push",
        "date": "2025-07-25",
        "subject": "Economy & Technology",
        "source": "The Economic Times",
        "summary": "India is making significant strides in its semiconductor mission, aiming to establish a robust ecosystem for chip manufacturing and design. This initiative is crucial for technological self-reliance and economic growth, attracting major global players.",
        "link": "post-1.html",
        "resource_link": "https://economictimes.indiatimes.com/news/economy/policy/india-semiconductor-mission-a-strategic-push/articleshow/100000001.cms"
    }
]